; ModuleID = 'dronet_linked'
source_filename = "dronet_linked"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%iree_hal_executable_library_header_t = type { i32, ptr, i32, i32 }
%iree_hal_executable_dispatch_attrs_v0_t = type { i64, i16, i8, i8, i32, i32, i16, i16, i64, i64, i64, i64, i64 }
%iree_hal_executable_source_location_v0_t = type { i32, i32, ptr }
%iree_hal_executable_stage_location_table_v0_t = type { i32, ptr, ptr }
%iree_hal_executable_library_v0_t = type { ptr, %iree_hal_executable_import_table_v0_t, %iree_hal_executable_export_table_v0_t, %iree_hal_executable_constant_table_v0_t, %iree_hal_executable_source_file_table_v0_t }
%iree_hal_executable_import_table_v0_t = type { i32, ptr }
%iree_hal_executable_export_table_v0_t = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%iree_hal_executable_constant_table_v0_t = type { i32 }
%iree_hal_executable_source_file_table_v0_t = type { i32, ptr }
%iree_hal_executable_dispatch_state_v0_t = type { i32, i32, i16, i16, i32, i32, i16, i8, i8, ptr, ptr, ptr }
%iree_hal_executable_workgroup_state_v0_t = type { i32, i32, i16, i16, i32, ptr, i32 }


!2 = distinct !DICompileUnit(language: DW_LANG_C17, file: !3, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!3 = !DIFile(filename: "configured_module_main_graph$async_dispatch_1.mlir", directory: "/scratch2/merlin/samples/core_pinning_single_workload/models/dronet/models/configs")
!4 = distinct !DICompileUnit(language: DW_LANG_C17, file: !5, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!5 = !DIFile(filename: "configured_module_main_graph$async_dispatch_2.mlir", directory: "/scratch2/merlin/samples/core_pinning_single_workload/models/dronet/models/configs")
!6 = distinct !DICompileUnit(language: DW_LANG_C17, file: !7, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!7 = !DIFile(filename: "configured_module_main_graph$async_dispatch_3.mlir", directory: "/scratch2/merlin/samples/core_pinning_single_workload/models/dronet/models/configs")
!8 = distinct !DICompileUnit(language: DW_LANG_C17, file: !9, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!9 = !DIFile(filename: "configured_module_main_graph$async_dispatch_4.mlir", directory: "/scratch2/merlin/samples/core_pinning_single_workload/models/dronet/models/configs")
!10 = distinct !DICompileUnit(language: DW_LANG_C17, file: !11, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!11 = !DIFile(filename: "configured_module_main_graph$async_dispatch_5.mlir", directory: "/scratch2/merlin/samples/core_pinning_single_workload/models/dronet/models/configs")
!12 = distinct !DICompileUnit(language: DW_LANG_C17, file: !13, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!13 = !DIFile(filename: "configured_module_main_graph$async_dispatch_6.mlir", directory: "/scratch2/merlin/samples/core_pinning_single_workload/models/dronet/models/configs")
!14 = distinct !DICompileUnit(language: DW_LANG_C17, file: !15, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!15 = !DIFile(filename: "configured_module_main_graph$async_dispatch_7.mlir", directory: "/scratch2/merlin/samples/core_pinning_single_workload/models/dronet/models/configs")
!16 = distinct !DICompileUnit(language: DW_LANG_C17, file: !17, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!17 = !DIFile(filename: "configured_module_main_graph$async_dispatch_8.mlir", directory: "/scratch2/merlin/samples/core_pinning_single_workload/models/dronet/models/configs")
!18 = distinct !DICompileUnit(language: DW_LANG_C17, file: !19, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!19 = !DIFile(filename: "configured_module_main_graph$async_dispatch_9.mlir", directory: "/scratch2/merlin/samples/core_pinning_single_workload/models/dronet/models/configs")
!20 = distinct !DICompileUnit(language: DW_LANG_C17, file: !21, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!21 = !DIFile(filename: "configured_module_main_graph$async_dispatch_10.mlir", directory: "/scratch2/merlin/samples/core_pinning_single_workload/models/dronet/models/configs")
!22 = distinct !DICompileUnit(language: DW_LANG_C17, file: !23, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!23 = !DIFile(filename: "configured_module_main_graph$async_dispatch_11.mlir", directory: "/scratch2/merlin/samples/core_pinning_single_workload/models/dronet/models/configs")
!24 = distinct !DICompileUnit(language: DW_LANG_C17, file: !25, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!25 = !DIFile(filename: "configured_module_main_graph$async_dispatch_12.mlir", directory: "/scratch2/merlin/samples/core_pinning_single_workload/models/dronet/models/configs")
!26 = distinct !DICompileUnit(language: DW_LANG_C17, file: !27, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!27 = !DIFile(filename: "configured_module_main_graph$async_dispatch_13.mlir", directory: "/scratch2/merlin/samples/core_pinning_single_workload/models/dronet/models/configs")
!28 = distinct !DICompileUnit(language: DW_LANG_C17, file: !29, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!29 = !DIFile(filename: "configured_module_main_graph$async_dispatch_14.mlir", directory: "/scratch2/merlin/samples/core_pinning_single_workload/models/dronet/models/configs")
!30 = !{i32 2, !"Debug Info Version", i32 3}
!31 = distinct !DISubprogram(name: "main_graph$async_dispatch_0_slow_memcpy", linkageName: "main_graph$async_dispatch_0_slow_memcpy", scope: !1, file: !1, line: 1, type: !32, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0)
!32 = !DISubroutineType(cc: DW_CC_normal, types: !33)
!33 = !{!34, !35, !66, !95}
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "iree_hal_executable_environment_v0_t", baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_executable_environment_v0_t", scope: !39, file: !39, line: 246, size: 768, elements: !40)
!39 = !DIFile(filename: "runtime/src/iree/hal/local/executable_library.h", directory: ".")
!40 = !{!41, !49, !52, !55, !57}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "constants", baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!44 = !DICompositeType(tag: DW_TAG_array_type, scope: !39, file: !39, line: 227, baseType: !45, size: 2048, elements: !47)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", baseType: !46)
!46 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!47 = !{!48}
!48 = !DISubrange(count: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "import_thunk", baseType: !50, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIBasicType(name: "void", encoding: DW_ATE_address)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "import_funcs", baseType: !53, size: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "import_contexts", baseType: !56, size: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "processor", baseType: !58, offset: 256)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_processor_v0_t", scope: !39, file: !39, line: 227, size: 512, elements: !59)
!59 = !{!60}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "data", baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_array_type, scope: !39, file: !39, line: 227, baseType: !62, size: 512, elements: !64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", baseType: !63)
!63 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!64 = !{!65}
!65 = !DISubrange(count: 8)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "iree_hal_executable_dispatch_state_v0_t", baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_executable_dispatch_state_v0_t", scope: !39, file: !39, line: 275, size: 384, elements: !70)
!70 = !{!71, !72, !73, !76, !77, !78, !79, !80, !83, !84, !85, !90}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_size_x", baseType: !45, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_size_y", baseType: !45, size: 32, offset: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_size_z", baseType: !74, size: 16, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", baseType: !75)
!75 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "constant_count", baseType: !74, size: 16, offset: 80)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_count_x", baseType: !45, size: 32, offset: 96)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_count_y", baseType: !45, size: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_count_z", baseType: !74, size: 16, offset: 160)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "max_concurrency", baseType: !81, size: 8, offset: 176)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", baseType: !82)
!82 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "binding_count", baseType: !81, size: 8, offset: 184)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "constants", baseType: !42, size: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "binding_ptrs", baseType: !86, size: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!88 = !DICompositeType(tag: DW_TAG_array_type, scope: !39, file: !39, line: 227, baseType: !89, size: 4096, elements: !47)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "binding_lengths", baseType: !91, size: 64, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!93 = !DICompositeType(tag: DW_TAG_array_type, scope: !39, file: !39, line: 227, baseType: !94, size: 4096, elements: !47)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", baseType: !62)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "iree_hal_executable_workgroup_state_v0_t", baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_executable_workgroup_state_v0_t", scope: !39, file: !39, line: 321, size: 256, elements: !99)
!99 = !{!100, !101, !102, !103, !104, !105, !106}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_id_x", baseType: !45, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_id_y", baseType: !45, size: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_id_z", baseType: !74, size: 16, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", baseType: !74, size: 16, offset: 80)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "processor_id", baseType: !45, size: 32, offset: 96)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "local_memory", baseType: !50, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "local_memory_size", baseType: !45, size: 32, offset: 192)
!107 = !DILocation(line: 10, column: 8, scope: !31)
!108 = !DILocation(line: 11, column: 8, scope: !31)
!109 = !DILocation(line: 12, column: 8, scope: !31)
!110 = !DILocation(line: 13, column: 8, scope: !31)
!111 = !DILocation(line: 15, column: 8, scope: !31)
!112 = !DILocation(line: 19, column: 8, scope: !31)
!113 = distinct !DISubprogram(name: "main_graph$async_dispatch_1_conv_32x112x112x5x5_f32", linkageName: "main_graph$async_dispatch_1_conv_32x112x112x5x5_f32", scope: !3, file: !3, line: 1, type: !32, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2)
!114 = !DILocation(line: 20, column: 8, scope: !113)
!115 = !DILocation(line: 14, column: 8, scope: !113)
!116 = !DILocation(line: 15, column: 8, scope: !113)
!117 = !DILocation(line: 16, column: 8, scope: !113)
!118 = !DILocation(line: 21, column: 8, scope: !113)
!119 = !DILocation(line: 27, column: 8, scope: !113)
!120 = !DILocation(line: 9, column: 8, scope: !113)
!121 = !DILocation(line: 23, column: 10, scope: !113)
!122 = !DILocation(line: 24, column: 10, scope: !113)
!123 = !DILocation(line: 29, column: 10, scope: !113)
!124 = !DILocation(line: 33, column: 8, scope: !113)
!125 = distinct !DISubprogram(name: "main_graph$async_dispatch_2_conv_32x55x55x3x3_f32", linkageName: "main_graph$async_dispatch_2_conv_32x55x55x3x3_f32", scope: !5, file: !5, line: 1, type: !32, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !4)
!126 = !DILocation(line: 16, column: 8, scope: !125)
!127 = !DILocation(line: 17, column: 8, scope: !125)
!128 = !DILocation(line: 18, column: 8, scope: !125)
!129 = !DILocation(line: 23, column: 8, scope: !125)
!130 = !DILocation(line: 30, column: 10, scope: !125)
!131 = !DILocation(line: 28, column: 8, scope: !125)
!132 = !DILocation(line: 9, column: 8, scope: !125)
!133 = !DILocation(line: 25, column: 10, scope: !125)
!134 = !DILocation(line: 31, column: 10, scope: !125)
!135 = !DILocation(line: 32, column: 10, scope: !125)
!136 = !DILocation(line: 33, column: 10, scope: !125)
!137 = !DILocation(line: 34, column: 10, scope: !125)
!138 = !DILocation(line: 35, column: 10, scope: !125)
!139 = !DILocation(line: 40, column: 8, scope: !125)
!140 = distinct !DISubprogram(name: "main_graph$async_dispatch_3_conv_32x28x28x32x3x3_f32", linkageName: "main_graph$async_dispatch_3_conv_32x28x28x32x3x3_f32", scope: !7, file: !7, line: 1, type: !32, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6)
!141 = !DILocation(line: 20, column: 8, scope: !140)
!142 = !DILocation(line: 14, column: 8, scope: !140)
!143 = !DILocation(line: 15, column: 8, scope: !140)
!144 = !DILocation(line: 16, column: 8, scope: !140)
!145 = !DILocation(line: 21, column: 8, scope: !140)
!146 = !DILocation(line: 27, column: 8, scope: !140)
!147 = !DILocation(line: 9, column: 8, scope: !140)
!148 = !DILocation(line: 23, column: 10, scope: !140)
!149 = !DILocation(line: 24, column: 10, scope: !140)
!150 = !DILocation(line: 29, column: 10, scope: !140)
!151 = !DILocation(line: 30, column: 10, scope: !140)
!152 = !DILocation(line: 31, column: 10, scope: !140)
!153 = !DILocation(line: 35, column: 8, scope: !140)
!154 = distinct !DISubprogram(name: "main_graph$async_dispatch_4_matmul_like_32x28x28x32_f32", linkageName: "main_graph$async_dispatch_4_matmul_like_32x28x28x32_f32", scope: !9, file: !9, line: 1, type: !32, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8)
!155 = !DILocation(line: 13, column: 8, scope: !154)
!156 = !DILocation(line: 14, column: 8, scope: !154)
!157 = !DILocation(line: 15, column: 8, scope: !154)
!158 = !DILocation(line: 20, column: 8, scope: !154)
!159 = !DILocation(line: 23, column: 10, scope: !154)
!160 = !DILocation(line: 27, column: 8, scope: !154)
