#map = affine_map<(d0) -> (d0)>
#map1 = affine_map<() -> ()>
#map2 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2, d3)>
#map3 = affine_map<(d0, d1) -> (d0, d1)>
#map4 = affine_map<(d0, d1) -> (d1)>
#map5 = affine_map<(d0, d1) -> (d0)>
#map6 = affine_map<(d0, d1) -> ()>
#map7 = affine_map<(d0) -> ()>
#map8 = affine_map<(d0, d1) -> (d0, 0)>
module {
  util.func public @main_graph$async(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view, %arg3: !hal.buffer_view, %arg4: !hal.fence, %arg5: !hal.fence) -> (!hal.buffer_view, !hal.buffer_view) attributes {inlining_policy = #util.inline.never, iree.abi.model = "coarse-fences", iree.abi.stub} {
    %cst = arith.constant dense<2> : tensor<1xi64>
    %cst_0 = arith.constant dense<1> : tensor<1xi64>
    %cst_1 = arith.constant dense<[[0.000000e+00], [0.111111112], [0.222222224], [0.333333343], [0.444444448], [0.555555582], [0.666666686], [0.777777791], [0.888888895], [1.000000e+00]]> : tensor<10x1xf32>
    %cst_2 = arith.constant dense<[[1.000000e+00], [0.888888895], [0.777777791], [0.666666627], [0.555555582], [0.444444418], [0.333333313], [0.222222209], [0.111111104], [0.000000e+00]]> : tensor<10x1xf32>
    %cst_3 = arith.constant dense<[0.000000e+00, -1.000000e-01]> : tensor<2xf32>
    %cst_4 = arith.constant dense<[-2.000000e-01, 0.000000e+00]> : tensor<2xf32>
    %cst_5 = arith.constant dense<1.000000e-01> : tensor<f32>
    %cst_6 = arith.constant dense<9.99999997E-7> : tensor<f32>
    %cst_7 = arith.constant dense<-1.000000e+00> : tensor<f32>
    %cst_8 = arith.constant dense<1.000000e+00> : tensor<f32>
    %cst_9 = arith.constant dense<5.000000e-01> : tensor<f32>
    %cst_10 = arith.constant dense<2.000000e+00> : tensor<f32>
    %cst_11 = arith.constant dense<9.99999974E-5> : tensor<f32>
    %cst_12 = arith.constant dense<"0xA4E062BD6F10A2BDF988443C9D175DBDC10D0BBEE2788DBD3D23A9BD501B7A3DA06B673DC090123EF900C63D2A100ABEC0E7D43D7E941CBC25580B3ECD8EBABD075D0E3EA3222C3D1ADEF53D6FAFC0BCE158683DC8F0F03BAD63CBBD0E57183DBEEE97BDDAE7F3BA769EDC3C7374EB3D4E39B33D106142BD382EA7BC892A01BEC026C63D1087BB3DA69D783D32427B3D4213F93D30DA0CBEC15A803DF17AB63D8A1A043EB867E7BDC529363D951A0CBE2FA62C3B565E043E93A9C5BC14469A3B0C6CA6BD2E66EEBD108FEDBDF4DAAA3DF64DA6BD55D2463C0EAE90BD2ECE43BD0402B7BD4844D8BC6FEF45BD8F289ABD724E2DBD35E2F53DD861BDBD345DAF3DBCD10E3E38A27F3C7362293D0C6787BD20FA3CBD035807BE2FA4EEBD66790DBCE11EA53DFADE123EB6D10C3E0BBD13BE6545C63D6335D93D3D61033E6D6313BDFDE110BE6E7C403DBF1E653BF4A2603D250A513D106844BD843DA53D1EE2823DECBBC4BD3035AFBC2A51A63D959BB63D03F5183D25A672BDE20DE33DEA84133EB5EFB1BC290708BEBC93E9BB850E793BAD14FDBDE95801BE330F883DD6C4E83DF8E2F0BD204E84BDFE1802BEC88B8A3C4F33AA3D706DA93CB7B0EF3D6DA8E9BD819AE23D24AF903DC74412BE545F0A3E52894C3D993BAC3D01D7453DAB55D03D34A2373DDDAD8CBD9FFE25BDBEF4CB3D3B399BBDE380CEBD195A2CBD5990CDBDC062AEBDBEE2E2BD96D8543D963567BC07AFE23CE3069F3D99A7013EF655EEBDE95BB5BB57B72BBD1A3AEDBD6ED50C3EA362E2BDBAE2BD3C7886133E4D0F7E3C3EA8F93CAA7AECBD0B22933BF532A0BD3CEE07BE9653ADBD3F8FA6BD9D507EBC8FF6C0BC19C801BE67E590BDA26D3FBC72EEA33D0902DE3D12F202BE97988B3D4FFB15BCD53E803DC446B9BC82C31B3D47FFD4BD581A843D8623133EE83DB6BD58094ABDDC2CE23DEDBC133E3172CE3D21125EBD29347B3D386DFBBDD03723BD11A8B4396362003ECBE981BC8A04A5BC947CC43DA4E7873DC3AFF8BC490EDF3CD3388BBDC1773B3D12F16FBDBECEE1BDB86F18BDB030243CD6E4E2BDCF2D7B3C"> : tensor<4x3x4x4xf32>
    %cst_13 = arith.constant dense<[-0.0291617829, 0.0185516253, -0.0336317755, 0.0323117375]> : tensor<4xf32>
    %cst_14 = arith.constant dense<"0x8800513D587D7D3DA2654FBD92003D3DA051473D5EC04ABD6A8B0CBD24D915BDD8974D3C1029F3BB2C48AA3C80DC47BC4AEF113D384EB23C04E760BDF845C4BC943F593DB29F1BBD4827E53CC6975F3DBCD0F43C143D94BCA0745B3B6CB6843C70D1EA3CC06C15BC708A483DE8501FBC004CD838807BB4BCD877703D34F2A8BC740C093D30D68F3CC0DDAFBA6884F53C94BFA7BC8A3E1CBD8062753AF065543C64FF76BD1436253DACB803BD3050A73B520D423D74A2C5BCA4C8D53C00CC223C40621ABDC029CEBBD8D22F3D54F4E0BC784F63BDA04B4F3C0277443D804CD73A603F71BD145A563DACF850BD3AE1023DFC9A4ABD80BA4A3CBC508BBC0CE1B13C4C15F6BC08FBF0BCF09F1CBDB4A1ED3C3024133D5AA269BDD0E22E3C52486DBD8CFBC73C8403EA3C5884F4BCCA397C3DA6E569BD168A00BDBEDA6FBD9E5654BD346AC7BC205D3FBCB053063DBCAA7EBDD03EABBC844339BD463A093D8CB5243D92827EBD508DE9BCFA7C22BDD46FCD3CB00D78BCA8693A3D682370BC90D04A3CFC473C3D60AE9CBCA00DDEBCF0D05CBC207FB3BBD4F8AF3C001692398CCC453DE4F2F0BCFAF1543DB06BEFBBFCAF4C3DD431B3BC380B45BC60DB6B3C68393EBDE89CA3BC1C98483D906A57BDB0ABA7BB524D343D426074BD5469393D0A9922BD30418DBB924119BD3422D0BC003D443C4CEAFBBC1C339EBCE468143D8C10B3BCC0638BBAC2C61BBD1C30103D20BD7A3BB84FE63C2082DD3C46C3533D8CE002BD64017BBD28BB283C00041B3B02972B3D30A4BCBB20FD2BBD800423BDBE2239BD380718BDF0E03ABC004E6F3D389E4B3DA22B6BBD1079B3BB3C6BD43CC6E800BDE02908BC00E9FF3B10E4E13BC06F643C741A25BD1A8262BDCA2C3EBDF05950BCA8083E3C7CF8D43CD8EFC23C74D8AEBCF0230BBDF23F04BD683D2EBC806062BD905DFEBCA092D33B303A593C4EC0283D28A6763C3E72263DB43E5F3D7A4F0DBDA69403BD10EE85BCC02FC8BCD8EB833C6059CF3B5411373DA042B03C8CF34B3D707A733CD039963CE8E4523C36B02E3D9C30823C02FE05BD903EDA3C388DCABC6008DDBB30D8233DE8A42A3DD461E8BC60F833BCC024963C8E8175BD602F9EBC4031E73AA8B72F3C08CB653DD4D5743DDC687E3DD040763C5018A3BC8E4A143DB87248BD8E4D743D529341BD0EF84A3DD86C4B3C40CC753CC0E9BA3CCA3C193DC20A473D50951EBDCC96B5BC56466B3DA82472BD50AA513C7A9E1FBD104486BB1052A23CD2DD79BDB00EB6BC36CC2CBDE80470BD181468BD08D17DBDB83743BC5073AEBB7410A83C842BA93CD822EABC40CB9CBAC490903CEC2A21BD06D552BDB4F1E03C3C6945BDE25B72BD48436D3CE039593C62141EBD3E6835BDA8D1D1BCF01CD0BCC0821EBB006213BC70DA8CBCB4C42ABDB24E32BD743147BDE0466A3B90CB91BC8CE6C33CA4CA443D002AF3BA3C04263D189B60BDF0CA64BD445727BD14997DBDF8602ABCDE5269BD4433B43C9CD882BCF4408BBCDAB55B3DA040893C647796BC307FF4BC08B0493DA0831EBC58B62B3CE43A2F3D4088CE3C300CDCBCA29D57BD82A8543D001CA439963745BDD42CD13C809D2C3B941CEFBC660A24BD56D8463D402C03BCA4FEFB3C80C2F4BC9CF60DBD60C9453BC0F334BB3C3422BD5A1E3D3DC025353B14372ABD0AE554BDA8D50EBC7098503DD81685BC7CB2AA3C7A75653D3048CD3BF030623D66332A3D4A46123DF000033DC49378BD364E323DF8D60E3C8092AA3CC2E5013D5C4C85BC942F453DE06A6BBCAA0A4ABD9A086ABDDE273E3D3CECB4BC0C2A883C40D16DBB90FFAABC247B9ABC30F3A23C04853B3DEC42683DC87E83BC381C123D2CA2CB3CFA8050BD8A23213D86CF2CBD3443393D345A883C48CC263C1AF131BD9E753FBDE07FB43B84D745BD986AD23CA8EC293CB2E0623D28597ABC260F42BDC86108BD18D3443CA074933C98E83C3D5CE0DC3C8C3D77BDD6A0403D9E2912BD90A8A2BB7C6582BC286B4E3D1E7F39BD2CF021BDFC8522BDE450A9BCEC98423D80467EBB48F6513DBE02133D209CAABC605606BD1612323DB07D673DE4FEB9BC801A75BAE4CE34BD1E605B3D40B1B9BC566C2E3DA8EB253C60578DBC1004BC3C40AF1EBC30F9FA3C00B1B03CB49A883C1C46773D969343BD20A0723D7066E13CD82628BD5A261B3DB6A71DBD3C313A3DD883503C50AA98BB18A27FBC10D43B3CDA8C28BD441643BD00E3A1B9FC7985BC98C5B3BCC090DBBA4A9229BD120C173D609F59BB48CA643DF871A53C16E219BD148F2BBD34CDA23C861F623DACCD54BDF06597BB8E4E23BDA00B003CF41F04BD305165BCD61610BDA84945BD2CDF8EBC283C903C60AB12BBAC108BBC7A225B3D6C1F1DBDF0CF34BC3068CD3C542BF33CC8C9773DFA6533BD34CE093DC0B5C13A0CF3BCBCEEC353BDE09CA8BB903EBDBBE022673CB01F36BC926E323DD42E5B3DFA0558BDE82261BD580BC23C209137BDC0E501BD6414BCBC00207D396A31253D7AB8473D40075FBB2C91D13C00BF543D34AEF8BC4EC812BDA492E53C3A5F123DB8F076BDAC737C3D00F62FBA607246BDEACF5FBDF4ECC03C387581BC5A102A3D80473E3D906ADA3CD8C9103CDED3153DB07346BD44633BBD8034B13A4499FB3C340918BD3ADC7FBD52504F3D00B29BBCB4B6763D7C7C3CBD50CFB7BB78CB5ABDA0F314BBB81EB33CD098BF3B7436F63CB227063D4C7F333DC032EEBCBAED04BDCC41793D90E485BCD0B733BD307145BD10D5F23BC84ED03C54F9D13C3078423D24DEF3BCB84EAF3C584FE7BCFC47E1BC0C59953C10E12E3C40AE8D3ADC59153DB84666BC8E400ABD48A9093DC437EDBCFC62CB3CB81824BC50865EBD2C6B9A3C001C06BB"> : tensor<2x256xf32>
    %cst_15 = arith.constant dense<[-0.0322122052, -0.0469594523]> : tensor<2xf32>
    %cst_16 = arith.constant dense<0> : tensor<1xi64>
    %cst_17 = arith.constant 0.000000e+00 : f32
    %cst_18 = arith.constant 0xFF800000 : f32
    %cst_19 = arith.constant 1.000000e+00 : f32
    %0 = hal.tensor.import wait(%arg4) => %arg0 : !hal.buffer_view -> tensor<1x3x64x64xf32>
    %1 = hal.tensor.import wait(%arg4) => %arg1 : !hal.buffer_view -> tensor<3xf32>
    %2 = hal.tensor.import wait(%arg4) => %arg2 : !hal.buffer_view -> tensor<2xf32>
    %3 = hal.tensor.import wait(%arg4) => %arg3 : !hal.buffer_view -> tensor<2xf32>
    %4 = tensor.empty() : tensor<1xf32>
    %5 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%cst_16 : tensor<1xi64>) outs(%4 : tensor<1xf32>) {
    ^bb0(%in: i64, %out: f32):
      %380 = arith.index_cast %in : i64 to index
      %extracted = tensor.extract %3[%380] : tensor<2xf32>
      linalg.yield %extracted : f32
    } -> tensor<1xf32>
    %collapsed = tensor.collapse_shape %5 [] : tensor<1xf32> into tensor<f32>
    %6 = tensor.empty() : tensor<f32>
    %7 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%collapsed, %cst_11 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %8 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%cst_0 : tensor<1xi64>) outs(%4 : tensor<1xf32>) {
    ^bb0(%in: i64, %out: f32):
      %380 = arith.index_cast %in : i64 to index
      %extracted = tensor.extract %3[%380] : tensor<2xf32>
      linalg.yield %extracted : f32
    } -> tensor<1xf32>
    %collapsed_20 = tensor.collapse_shape %8 [] : tensor<1xf32> into tensor<f32>
    %9 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%collapsed_20, %cst_11 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %10 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%7, %9 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.addf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %11 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%10, %cst_10 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.divf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %12 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%9, %7 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.subf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %13 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%12, %cst_9 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.divf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %14 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%cst : tensor<1xi64>) outs(%4 : tensor<1xf32>) {
    ^bb0(%in: i64, %out: f32):
      %380 = arith.index_cast %in : i64 to index
      %extracted = tensor.extract %1[%380] : tensor<3xf32>
      linalg.yield %extracted : f32
    } -> tensor<1xf32>
    %collapsed_21 = tensor.collapse_shape %14 [] : tensor<1xf32> into tensor<f32>
    %15 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%13, %cst_10 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.divf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %16 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%collapsed_21, %15 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.addf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %17 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%cst_16 : tensor<1xi64>) outs(%4 : tensor<1xf32>) {
    ^bb0(%in: i64, %out: f32):
      %380 = arith.index_cast %in : i64 to index
      %extracted = tensor.extract %1[%380] : tensor<3xf32>
      linalg.yield %extracted : f32
    } -> tensor<1xf32>
    %collapsed_22 = tensor.collapse_shape %17 [] : tensor<1xf32> into tensor<f32>
    %18 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = []} ins(%16 : tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %out: f32):
      %380 = math.cos %in : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %19 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%11, %18 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %20 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%collapsed_22, %19 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.addf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %21 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%cst_0 : tensor<1xi64>) outs(%4 : tensor<1xf32>) {
    ^bb0(%in: i64, %out: f32):
      %380 = arith.index_cast %in : i64 to index
      %extracted = tensor.extract %1[%380] : tensor<3xf32>
      linalg.yield %extracted : f32
    } -> tensor<1xf32>
    %collapsed_23 = tensor.collapse_shape %21 [] : tensor<1xf32> into tensor<f32>
    %22 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = []} ins(%16 : tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %out: f32):
      %380 = math.sin %in : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %23 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%11, %22 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %24 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%collapsed_23, %23 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.addf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %25 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%collapsed_21, %13 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.addf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %expanded = tensor.expand_shape %20 [] output_shape [1] : tensor<f32> into tensor<1xf32>
    %expanded_24 = tensor.expand_shape %24 [] output_shape [1] : tensor<f32> into tensor<1xf32>
    %expanded_25 = tensor.expand_shape %25 [] output_shape [1] : tensor<f32> into tensor<1xf32>
    %concat = tensor.concat dim(0) %expanded, %expanded_24, %expanded_25 : (tensor<1xf32>, tensor<1xf32>, tensor<1xf32>) -> tensor<3xf32>
    %padded = tensor.pad %0 low[0, 0, 1, 1] high[0, 0, 1, 1] {
    ^bb0(%arg6: index, %arg7: index, %arg8: index, %arg9: index):
      tensor.yield %cst_17 : f32
    } : tensor<1x3x64x64xf32> to tensor<1x3x66x66xf32>
    %26 = tensor.empty() : tensor<1x4x16x16xf32>
    %broadcasted = linalg.broadcast ins(%cst_13 : tensor<4xf32>) outs(%26 : tensor<1x4x16x16xf32>) dimensions = [0, 2, 3] 
    %27 = linalg.conv_2d_nchw_fchw {dilations = dense<1> : vector<2xi64>, strides = dense<4> : vector<2xi64>} ins(%padded, %cst_12 : tensor<1x3x66x66xf32>, tensor<4x3x4x4xf32>) outs(%broadcasted : tensor<1x4x16x16xf32>) -> tensor<1x4x16x16xf32>
    %28 = linalg.generic {indexing_maps = [#map2, #map2], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%27 : tensor<1x4x16x16xf32>) outs(%26 : tensor<1x4x16x16xf32>) {
    ^bb0(%in: f32, %out: f32):
      %380 = arith.cmpf ugt, %in, %cst_17 : f32
      %381 = arith.select %380, %in, %cst_17 : f32
      linalg.yield %381 : f32
    } -> tensor<1x4x16x16xf32>
    %29 = tensor.empty() : tensor<1x4x8x8xf32>
    %30 = linalg.fill ins(%cst_18 : f32) outs(%29 : tensor<1x4x8x8xf32>) -> tensor<1x4x8x8xf32>
    %31 = tensor.empty() : tensor<2x2xf32>
    %32 = linalg.pooling_nchw_max {dilations = dense<1> : vector<2xi64>, strides = dense<2> : vector<2xi64>} ins(%28, %31 : tensor<1x4x16x16xf32>, tensor<2x2xf32>) outs(%30 : tensor<1x4x8x8xf32>) -> tensor<1x4x8x8xf32>
    %collapsed_26 = tensor.collapse_shape %32 [[0], [1, 2, 3]] : tensor<1x4x8x8xf32> into tensor<1x256xf32>
    %33 = tensor.empty() : tensor<256x2xf32>
    %transposed = linalg.transpose ins(%cst_14 : tensor<2x256xf32>) outs(%33 : tensor<256x2xf32>) permutation = [1, 0] 
    %34 = tensor.empty() : tensor<1x2xf32>
    %35 = linalg.fill ins(%cst_17 : f32) outs(%34 : tensor<1x2xf32>) -> tensor<1x2xf32>
    %36 = linalg.matmul ins(%collapsed_26, %transposed : tensor<1x256xf32>, tensor<256x2xf32>) outs(%35 : tensor<1x2xf32>) -> tensor<1x2xf32>
    %37 = linalg.generic {indexing_maps = [#map3, #map4, #map3], iterator_types = ["parallel", "parallel"]} ins(%36, %cst_15 : tensor<1x2xf32>, tensor<2xf32>) outs(%34 : tensor<1x2xf32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.addf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<1x2xf32>
    %collapsed_27 = tensor.collapse_shape %37 [[0, 1]] : tensor<1x2xf32> into tensor<2xf32>
    %38 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%cst_16 : tensor<1xi64>) outs(%4 : tensor<1xf32>) {
    ^bb0(%in: i64, %out: f32):
      %380 = arith.index_cast %in : i64 to index
      %extracted = tensor.extract %2[%380] : tensor<2xf32>
      linalg.yield %extracted : f32
    } -> tensor<1xf32>
    %collapsed_28 = tensor.collapse_shape %38 [] : tensor<1xf32> into tensor<f32>
    %39 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%cst_0 : tensor<1xi64>) outs(%4 : tensor<1xf32>) {
    ^bb0(%in: i64, %out: f32):
      %380 = arith.index_cast %in : i64 to index
      %extracted = tensor.extract %2[%380] : tensor<2xf32>
      linalg.yield %extracted : f32
    } -> tensor<1xf32>
    %collapsed_29 = tensor.collapse_shape %39 [] : tensor<1xf32> into tensor<f32>
    %40 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = []} ins(%collapsed_28 : tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %out: f32):
      %380 = math.cos %in : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %41 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%40, %cst_8 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %42 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%collapsed_28, %collapsed_29 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.addf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %43 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = []} ins(%42 : tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %out: f32):
      %380 = math.cos %in : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %44 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%43, %cst_8 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %45 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%41, %44 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.addf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %46 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = []} ins(%collapsed_28 : tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %out: f32):
      %380 = math.sin %in : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %47 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%46, %cst_8 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %48 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = []} ins(%42 : tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %out: f32):
      %380 = math.sin %in : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %49 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%48, %cst_8 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %50 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%47, %49 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.addf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %expanded_30 = tensor.expand_shape %45 [] output_shape [1] : tensor<f32> into tensor<1xf32>
    %expanded_31 = tensor.expand_shape %50 [] output_shape [1] : tensor<f32> into tensor<1xf32>
    %concat_32 = tensor.concat dim(0) %expanded_30, %expanded_31 : (tensor<1xf32>, tensor<1xf32>) -> tensor<2xf32>
    %51 = tensor.empty() : tensor<2xf32>
    %52 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%collapsed_27, %concat_32 : tensor<2xf32>, tensor<2xf32>) outs(%51 : tensor<2xf32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.subf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<2xf32>
    %53 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%46, %cst_7 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %54 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%53, %49 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.subf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %55 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%48, %cst_7 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %expanded_33 = tensor.expand_shape %54 [] output_shape [1] : tensor<f32> into tensor<1xf32>
    %expanded_34 = tensor.expand_shape %55 [] output_shape [1] : tensor<f32> into tensor<1xf32>
    %concat_35 = tensor.concat dim(0) %expanded_33, %expanded_34 : (tensor<1xf32>, tensor<1xf32>) -> tensor<2xf32>
    %expanded_36 = tensor.expand_shape %44 [] output_shape [1] : tensor<f32> into tensor<1xf32>
    %concat_37 = tensor.concat dim(0) %expanded_30, %expanded_36 : (tensor<1xf32>, tensor<1xf32>) -> tensor<2xf32>
    %expanded_38 = tensor.expand_shape %concat_35 [[0, 1]] output_shape [1, 2] : tensor<2xf32> into tensor<1x2xf32>
    %expanded_39 = tensor.expand_shape %concat_37 [[0, 1]] output_shape [1, 2] : tensor<2xf32> into tensor<1x2xf32>
    %concat_40 = tensor.concat dim(0) %expanded_38, %expanded_39 : (tensor<1x2xf32>, tensor<1x2xf32>) -> tensor<2x2xf32>
    %56 = linalg.generic {indexing_maps = [#map5, #map3], iterator_types = ["parallel", "parallel"]} ins(%cst_16 : tensor<1xi64>) outs(%34 : tensor<1x2xf32>) {
    ^bb0(%in: i64, %out: f32):
      %380 = arith.index_cast %in : i64 to index
      %381 = linalg.index 1 : index
      %extracted = tensor.extract %concat_40[%380, %381] : tensor<2x2xf32>
      linalg.yield %extracted : f32
    } -> tensor<1x2xf32>
    %collapsed_41 = tensor.collapse_shape %56 [[0, 1]] : tensor<1x2xf32> into tensor<2xf32>
    %57 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%cst_16 : tensor<1xi64>) outs(%4 : tensor<1xf32>) {
    ^bb0(%in: i64, %out: f32):
      %380 = arith.index_cast %in : i64 to index
      %extracted = tensor.extract %collapsed_41[%380] : tensor<2xf32>
      linalg.yield %extracted : f32
    } -> tensor<1xf32>
    %collapsed_42 = tensor.collapse_shape %57 [] : tensor<1xf32> into tensor<f32>
    %58 = linalg.generic {indexing_maps = [#map5, #map3], iterator_types = ["parallel", "parallel"]} ins(%cst_0 : tensor<1xi64>) outs(%34 : tensor<1x2xf32>) {
    ^bb0(%in: i64, %out: f32):
      %380 = arith.index_cast %in : i64 to index
      %381 = linalg.index 1 : index
      %extracted = tensor.extract %concat_40[%380, %381] : tensor<2x2xf32>
      linalg.yield %extracted : f32
    } -> tensor<1x2xf32>
    %collapsed_43 = tensor.collapse_shape %58 [[0, 1]] : tensor<1x2xf32> into tensor<2xf32>
    %59 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%cst_0 : tensor<1xi64>) outs(%4 : tensor<1xf32>) {
    ^bb0(%in: i64, %out: f32):
      %380 = arith.index_cast %in : i64 to index
      %extracted = tensor.extract %collapsed_43[%380] : tensor<2xf32>
      linalg.yield %extracted : f32
    } -> tensor<1xf32>
    %collapsed_44 = tensor.collapse_shape %59 [] : tensor<1xf32> into tensor<f32>
    %60 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%collapsed_42, %collapsed_44 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %61 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%cst_0 : tensor<1xi64>) outs(%4 : tensor<1xf32>) {
    ^bb0(%in: i64, %out: f32):
      %380 = arith.index_cast %in : i64 to index
      %extracted = tensor.extract %collapsed_41[%380] : tensor<2xf32>
      linalg.yield %extracted : f32
    } -> tensor<1xf32>
    %collapsed_45 = tensor.collapse_shape %61 [] : tensor<1xf32> into tensor<f32>
    %62 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%cst_16 : tensor<1xi64>) outs(%4 : tensor<1xf32>) {
    ^bb0(%in: i64, %out: f32):
      %380 = arith.index_cast %in : i64 to index
      %extracted = tensor.extract %collapsed_43[%380] : tensor<2xf32>
      linalg.yield %extracted : f32
    } -> tensor<1xf32>
    %collapsed_46 = tensor.collapse_shape %62 [] : tensor<1xf32> into tensor<f32>
    %63 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%collapsed_45, %collapsed_46 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %64 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%60, %63 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.subf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %65 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%64, %cst_6 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.addf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %66 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = []} ins(%65 : tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %out: f32):
      %380 = arith.cmpf one, %in, %cst_17 : f32
      cf.assert %380, "unimplemented: tensor with zero element"
      %381 = arith.divf %cst_19, %in : f32
      linalg.yield %381 : f32
    } -> tensor<f32>
    %67 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%66, %cst_8 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %68 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = []} ins(%collapsed_45 : tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %out: f32):
      %380 = arith.negf %in : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %expanded_47 = tensor.expand_shape %68 [] output_shape [1] : tensor<f32> into tensor<1xf32>
    %concat_48 = tensor.concat dim(0) %59, %expanded_47 : (tensor<1xf32>, tensor<1xf32>) -> tensor<2xf32>
    %69 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = []} ins(%collapsed_46 : tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %out: f32):
      %380 = arith.negf %in : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %expanded_49 = tensor.expand_shape %69 [] output_shape [1] : tensor<f32> into tensor<1xf32>
    %concat_50 = tensor.concat dim(0) %expanded_49, %57 : (tensor<1xf32>, tensor<1xf32>) -> tensor<2xf32>
    %expanded_51 = tensor.expand_shape %concat_48 [[0, 1]] output_shape [1, 2] : tensor<2xf32> into tensor<1x2xf32>
    %expanded_52 = tensor.expand_shape %concat_50 [[0, 1]] output_shape [1, 2] : tensor<2xf32> into tensor<1x2xf32>
    %concat_53 = tensor.concat dim(0) %expanded_51, %expanded_52 : (tensor<1x2xf32>, tensor<1x2xf32>) -> tensor<2x2xf32>
    %70 = linalg.generic {indexing_maps = [#map3, #map6, #map3], iterator_types = ["parallel", "parallel"]} ins(%concat_53, %67 : tensor<2x2xf32>, tensor<f32>) outs(%31 : tensor<2x2xf32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<2x2xf32>
    %71 = linalg.fill ins(%cst_17 : f32) outs(%51 : tensor<2xf32>) -> tensor<2xf32>
    %72 = linalg.matvec ins(%70, %52 : tensor<2x2xf32>, tensor<2xf32>) outs(%71 : tensor<2xf32>) -> tensor<2xf32>
    %73 = linalg.generic {indexing_maps = [#map, #map7, #map], iterator_types = ["parallel"]} ins(%72, %cst_5 : tensor<2xf32>, tensor<f32>) outs(%51 : tensor<2xf32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<2xf32>
    %74 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%2, %73 : tensor<2xf32>, tensor<2xf32>) outs(%51 : tensor<2xf32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.addf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<2xf32>
    %75 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%cst_16 : tensor<1xi64>) outs(%4 : tensor<1xf32>) {
    ^bb0(%in: i64, %out: f32):
      %380 = arith.index_cast %in : i64 to index
      %extracted = tensor.extract %74[%380] : tensor<2xf32>
      linalg.yield %extracted : f32
    } -> tensor<1xf32>
    %collapsed_54 = tensor.collapse_shape %75 [] : tensor<1xf32> into tensor<f32>
    %76 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%cst_0 : tensor<1xi64>) outs(%4 : tensor<1xf32>) {
    ^bb0(%in: i64, %out: f32):
      %380 = arith.index_cast %in : i64 to index
      %extracted = tensor.extract %74[%380] : tensor<2xf32>
      linalg.yield %extracted : f32
    } -> tensor<1xf32>
    %collapsed_55 = tensor.collapse_shape %76 [] : tensor<1xf32> into tensor<f32>
    %77 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = []} ins(%collapsed_54 : tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %out: f32):
      %380 = math.cos %in : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %78 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%77, %cst_8 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %79 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%collapsed_54, %collapsed_55 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.addf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %80 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = []} ins(%79 : tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %out: f32):
      %380 = math.cos %in : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %81 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%80, %cst_8 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %82 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%78, %81 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.addf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %83 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = []} ins(%collapsed_54 : tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %out: f32):
      %380 = math.sin %in : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %84 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%83, %cst_8 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %85 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = []} ins(%79 : tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %out: f32):
      %380 = math.sin %in : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %86 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%85, %cst_8 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %87 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%84, %86 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.addf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %expanded_56 = tensor.expand_shape %82 [] output_shape [1] : tensor<f32> into tensor<1xf32>
    %expanded_57 = tensor.expand_shape %87 [] output_shape [1] : tensor<f32> into tensor<1xf32>
    %concat_58 = tensor.concat dim(0) %expanded_56, %expanded_57 : (tensor<1xf32>, tensor<1xf32>) -> tensor<2xf32>
    %88 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%collapsed_27, %concat_58 : tensor<2xf32>, tensor<2xf32>) outs(%51 : tensor<2xf32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.subf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<2xf32>
    %89 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%83, %cst_7 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %90 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%89, %86 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.subf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %91 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%85, %cst_7 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %expanded_59 = tensor.expand_shape %90 [] output_shape [1] : tensor<f32> into tensor<1xf32>
    %expanded_60 = tensor.expand_shape %91 [] output_shape [1] : tensor<f32> into tensor<1xf32>
    %concat_61 = tensor.concat dim(0) %expanded_59, %expanded_60 : (tensor<1xf32>, tensor<1xf32>) -> tensor<2xf32>
    %expanded_62 = tensor.expand_shape %81 [] output_shape [1] : tensor<f32> into tensor<1xf32>
    %concat_63 = tensor.concat dim(0) %expanded_56, %expanded_62 : (tensor<1xf32>, tensor<1xf32>) -> tensor<2xf32>
    %expanded_64 = tensor.expand_shape %concat_61 [[0, 1]] output_shape [1, 2] : tensor<2xf32> into tensor<1x2xf32>
    %expanded_65 = tensor.expand_shape %concat_63 [[0, 1]] output_shape [1, 2] : tensor<2xf32> into tensor<1x2xf32>
    %concat_66 = tensor.concat dim(0) %expanded_64, %expanded_65 : (tensor<1x2xf32>, tensor<1x2xf32>) -> tensor<2x2xf32>
    %92 = linalg.generic {indexing_maps = [#map5, #map3], iterator_types = ["parallel", "parallel"]} ins(%cst_16 : tensor<1xi64>) outs(%34 : tensor<1x2xf32>) {
    ^bb0(%in: i64, %out: f32):
      %380 = arith.index_cast %in : i64 to index
      %381 = linalg.index 1 : index
      %extracted = tensor.extract %concat_66[%380, %381] : tensor<2x2xf32>
      linalg.yield %extracted : f32
    } -> tensor<1x2xf32>
    %collapsed_67 = tensor.collapse_shape %92 [[0, 1]] : tensor<1x2xf32> into tensor<2xf32>
    %93 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%cst_16 : tensor<1xi64>) outs(%4 : tensor<1xf32>) {
    ^bb0(%in: i64, %out: f32):
      %380 = arith.index_cast %in : i64 to index
      %extracted = tensor.extract %collapsed_67[%380] : tensor<2xf32>
      linalg.yield %extracted : f32
    } -> tensor<1xf32>
    %collapsed_68 = tensor.collapse_shape %93 [] : tensor<1xf32> into tensor<f32>
    %94 = linalg.generic {indexing_maps = [#map5, #map3], iterator_types = ["parallel", "parallel"]} ins(%cst_0 : tensor<1xi64>) outs(%34 : tensor<1x2xf32>) {
    ^bb0(%in: i64, %out: f32):
      %380 = arith.index_cast %in : i64 to index
      %381 = linalg.index 1 : index
      %extracted = tensor.extract %concat_66[%380, %381] : tensor<2x2xf32>
      linalg.yield %extracted : f32
    } -> tensor<1x2xf32>
    %collapsed_69 = tensor.collapse_shape %94 [[0, 1]] : tensor<1x2xf32> into tensor<2xf32>
    %95 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%cst_0 : tensor<1xi64>) outs(%4 : tensor<1xf32>) {
    ^bb0(%in: i64, %out: f32):
      %380 = arith.index_cast %in : i64 to index
      %extracted = tensor.extract %collapsed_69[%380] : tensor<2xf32>
      linalg.yield %extracted : f32
    } -> tensor<1xf32>
    %collapsed_70 = tensor.collapse_shape %95 [] : tensor<1xf32> into tensor<f32>
    %96 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%collapsed_68, %collapsed_70 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %97 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%cst_0 : tensor<1xi64>) outs(%4 : tensor<1xf32>) {
    ^bb0(%in: i64, %out: f32):
      %380 = arith.index_cast %in : i64 to index
      %extracted = tensor.extract %collapsed_67[%380] : tensor<2xf32>
      linalg.yield %extracted : f32
    } -> tensor<1xf32>
    %collapsed_71 = tensor.collapse_shape %97 [] : tensor<1xf32> into tensor<f32>
    %98 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%cst_16 : tensor<1xi64>) outs(%4 : tensor<1xf32>) {
    ^bb0(%in: i64, %out: f32):
      %380 = arith.index_cast %in : i64 to index
      %extracted = tensor.extract %collapsed_69[%380] : tensor<2xf32>
      linalg.yield %extracted : f32
    } -> tensor<1xf32>
    %collapsed_72 = tensor.collapse_shape %98 [] : tensor<1xf32> into tensor<f32>
    %99 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%collapsed_71, %collapsed_72 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %100 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%96, %99 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.subf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %101 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%100, %cst_6 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.addf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %102 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = []} ins(%101 : tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %out: f32):
      %380 = arith.cmpf one, %in, %cst_17 : f32
      cf.assert %380, "unimplemented: tensor with zero element"
      %381 = arith.divf %cst_19, %in : f32
      linalg.yield %381 : f32
    } -> tensor<f32>
    %103 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%102, %cst_8 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %104 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = []} ins(%collapsed_71 : tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %out: f32):
      %380 = arith.negf %in : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %expanded_73 = tensor.expand_shape %104 [] output_shape [1] : tensor<f32> into tensor<1xf32>
    %concat_74 = tensor.concat dim(0) %95, %expanded_73 : (tensor<1xf32>, tensor<1xf32>) -> tensor<2xf32>
    %105 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = []} ins(%collapsed_72 : tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %out: f32):
      %380 = arith.negf %in : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %expanded_75 = tensor.expand_shape %105 [] output_shape [1] : tensor<f32> into tensor<1xf32>
    %concat_76 = tensor.concat dim(0) %expanded_75, %93 : (tensor<1xf32>, tensor<1xf32>) -> tensor<2xf32>
    %expanded_77 = tensor.expand_shape %concat_74 [[0, 1]] output_shape [1, 2] : tensor<2xf32> into tensor<1x2xf32>
    %expanded_78 = tensor.expand_shape %concat_76 [[0, 1]] output_shape [1, 2] : tensor<2xf32> into tensor<1x2xf32>
    %concat_79 = tensor.concat dim(0) %expanded_77, %expanded_78 : (tensor<1x2xf32>, tensor<1x2xf32>) -> tensor<2x2xf32>
    %106 = linalg.generic {indexing_maps = [#map3, #map6, #map3], iterator_types = ["parallel", "parallel"]} ins(%concat_79, %103 : tensor<2x2xf32>, tensor<f32>) outs(%31 : tensor<2x2xf32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<2x2xf32>
    %107 = linalg.matvec ins(%106, %88 : tensor<2x2xf32>, tensor<2xf32>) outs(%71 : tensor<2xf32>) -> tensor<2xf32>
    %108 = linalg.generic {indexing_maps = [#map, #map7, #map], iterator_types = ["parallel"]} ins(%107, %cst_5 : tensor<2xf32>, tensor<f32>) outs(%51 : tensor<2xf32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<2xf32>
    %109 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%74, %108 : tensor<2xf32>, tensor<2xf32>) outs(%51 : tensor<2xf32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.addf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<2xf32>
    %110 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%cst_16 : tensor<1xi64>) outs(%4 : tensor<1xf32>) {
    ^bb0(%in: i64, %out: f32):
      %380 = arith.index_cast %in : i64 to index
      %extracted = tensor.extract %109[%380] : tensor<2xf32>
      linalg.yield %extracted : f32
    } -> tensor<1xf32>
    %collapsed_80 = tensor.collapse_shape %110 [] : tensor<1xf32> into tensor<f32>
    %111 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel"]} ins(%cst_0 : tensor<1xi64>) outs(%4 : tensor<1xf32>) {
    ^bb0(%in: i64, %out: f32):
      %380 = arith.index_cast %in : i64 to index
      %extracted = tensor.extract %109[%380] : tensor<2xf32>
      linalg.yield %extracted : f32
    } -> tensor<1xf32>
    %collapsed_81 = tensor.collapse_shape %111 [] : tensor<1xf32> into tensor<f32>
    %112 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = []} ins(%collapsed_80 : tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %out: f32):
      %380 = math.cos %in : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %113 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%112, %cst_8 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %114 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%collapsed_80, %collapsed_81 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.addf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %115 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = []} ins(%114 : tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %out: f32):
      %380 = math.cos %in : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %116 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%115, %cst_8 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %117 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%113, %116 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.addf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %118 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = []} ins(%collapsed_80 : tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %out: f32):
      %380 = math.sin %in : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %119 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%118, %cst_8 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %120 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = []} ins(%114 : tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %out: f32):
      %380 = math.sin %in : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %121 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%120, %cst_8 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %122 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%119, %121 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.addf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %expanded_82 = tensor.expand_shape %117 [] output_shape [1] : tensor<f32> into tensor<1xf32>
    %expanded_83 = tensor.expand_shape %122 [] output_shape [1] : tensor<f32> into tensor<1xf32>
    %concat_84 = tensor.concat dim(0) %expanded_82, %expanded_83 : (tensor<1xf32>, tensor<1xf32>) -> tensor<2xf32>
    %123 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel"]} ins(%collapsed_27, %concat_84 : tensor<2xf32>, tensor<2xf32>) outs(%51 : tensor<2xf32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.subf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<2xf32>
    %124 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%118, %cst_7 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %125 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%124, %121 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.subf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %126 = linalg.generic {indexing_maps = [#map1, #map1, #map1], iterator_types = []} ins(%120, %cst_7 : tensor<f32>, tensor<f32>) outs(%6 : tensor<f32>) {
    ^bb0(%in: f32, %in_268: f32, %out: f32):
      %380 = arith.mulf %in, %in_268 : f32
      linalg.yield %380 : f32
    } -> tensor<f32>
    %expanded_85 = tensor.expand_shape %125 [] output_shape [1] : tensor<f32> into tensor<1xf32>
    %expanded_86 = tensor.expand_shape %126 [] output_shape [1] : tensor<f32> into tensor<1xf32>
    %concat_87 = tensor.concat dim(0) %expanded_85, %expanded_86 : (tensor<1xf32>, tensor<1xf32>) -> tensor<2xf32>
