#executable_target_embedded_elf_x86_64 = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "znver3", cpu_features = "+prfchw,-cldemote,+avx,+aes,+sahf,+pclmul,-xop,+crc32,-amx-fp8,+xsaves,-avx512fp16,-usermsr,-sm4,-egpr,+sse4.1,-avx512ifma,+xsave,+sse4.2,-tsxldtrk,-sm3,-ptwrite,-widekl,-movrs,+invpcid,+64bit,+xsavec,-avx10.1-512,-avx512vpopcntdq,+cmov,-avx512vp2intersect,-avx512cd,+movbe,-avxvnniint8,-ccmp,-amx-int8,-kl,-avx10.1-256,-sha512,-avxvnni,-rtm,+adx,+avx2,-hreset,-movdiri,-serialize,+vpclmulqdq,-avx512vl,-uintr,-cf,+clflushopt,-raoint,-cmpccxadd,+bmi,-amx-tile,+sse,-avx10.2-256,-gfni,-avxvnniint16,-amx-fp16,-zu,-ndd,+xsaveopt,+rdrnd,-avx512f,-amx-bf16,-avx512bf16,-avx512vnni,-push2pop2,+cx8,-avx512bw,+sse3,+pku,-nf,-amx-tf32,-amx-avx512,+fsgsbase,+clzero,+mwaitx,-lwp,+lzcnt,+sha,-movdir64b,-ppx,+wbnoinvd,-enqcmd,-amx-transpose,-avx10.2-512,-avxneconvert,-tbm,-pconfig,-amx-complex,+ssse3,+cx16,+bmi2,+fma,+popcnt,-avxifma,+f16c,-avx512bitalg,+rdpru,+clwb,+mmx,+sse2,+rdseed,-avx512vbmi2,-prefetchi,-amx-movrs,+rdpid,-fma4,-avx512vbmi,+shstk,+vaes,-waitpkg,-sgx,+fxsr,-avx512dq,+sse4a", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", iree.encoding.resolver = #iree_cpu.cpu_encoding_resolver<>, max_stack_allocation_size = 32768 : i64, native_vector_size = 32 : i64, target_triple = "x86_64-unknown-unknown-eabi-elf"}>
#map = affine_map<() -> ()>
#map1 = affine_map<(d0, d1, d2, d3, d4, d5) -> (d3, d1 * 4 + d4, d2 * 4 + d5)>
#map2 = affine_map<(d0, d1, d2, d3, d4, d5) -> (d0, d3, d4, d5)>
#map3 = affine_map<(d0, d1, d2, d3, d4, d5) -> (d0, d1, d2)>
#map4 = affine_map<(d0, d1, d2) -> (d0, d1, d2)>
#map5 = affine_map<(d0, d1, d2) -> (d0)>
#map6 = affine_map<(d0, d1, d2, d3, d4) -> (d0, d1 * 2 + d3, d2 * 2 + d4)>
#map7 = affine_map<(d0, d1, d2, d3, d4) -> (d3, d4)>
#map8 = affine_map<(d0, d1, d2, d3, d4) -> (d0, d1, d2)>
#map9 = affine_map<(d0, d1) -> (d0, d1)>
#map10 = affine_map<(d0) -> (d0)>
#map11 = affine_map<(d0, d1) -> (d1)>
#map12 = affine_map<(d0, d1) -> (d0)>
#device_target_local = #hal.device.target<"local", [#executable_target_embedded_elf_x86_64]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_local
  flow.executable private @main_graph$async_dispatch_0 {
    flow.executable.export public @main_graph$async_dispatch_0_elementwise_broadcast workgroups() -> (index, index, index) {
      %c1 = arith.constant 1 : index
      flow.return %c1, %c1, %c1 : index, index, index
    }
    builtin.module {
      func.func @main_graph$async_dispatch_0_elementwise_broadcast(%arg0: !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>>, %arg1: !iree_tensor_ext.dispatch.tensor<readonly:tensor<3xf32>>, %arg2: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>, %arg3: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>, %arg4: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>) {
        %cst = arith.constant 9.99999974E-5 : f32
        %cst_0 = arith.constant 2.000000e+00 : f32
        %cst_1 = arith.constant 5.000000e-01 : f32
        %c0 = arith.constant 0 : index
        %c1 = arith.constant 1 : index
        %c2 = arith.constant 2 : index
        %0 = iree_tensor_ext.dispatch.tensor.load %arg0, offsets = [0], sizes = [2], strides = [1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>> -> tensor<2xf32>
        %1 = iree_tensor_ext.dispatch.tensor.load %arg1, offsets = [0], sizes = [3], strides = [1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<3xf32>> -> tensor<3xf32>
        %2 = tensor.empty() : tensor<f32>
        %3 = linalg.generic {indexing_maps = [#map], iterator_types = []} outs(%2 : tensor<f32>) {
        ^bb0(%out: f32):
          %extracted = tensor.extract %0[%c0] : tensor<2xf32>
          %6 = arith.mulf %extracted, %cst : f32
          %extracted_2 = tensor.extract %0[%c1] : tensor<2xf32>
          %7 = arith.mulf %extracted_2, %cst : f32
          %8 = arith.addf %6, %7 : f32
          %9 = arith.divf %8, %cst_0 : f32
          %10 = arith.subf %7, %6 : f32
          %11 = arith.divf %10, %cst_1 : f32
          %extracted_3 = tensor.extract %1[%c2] : tensor<3xf32>
          %12 = arith.divf %11, %cst_0 : f32
          %13 = arith.addf %extracted_3, %12 : f32
          %14 = math.sin %13 : f32
          %15 = arith.mulf %9, %14 : f32
          %extracted_4 = tensor.extract %1[%c1] : tensor<3xf32>
          %16 = arith.addf %extracted_4, %15 : f32
          linalg.yield %16 : f32
        } -> tensor<f32>
        %4 = linalg.generic {indexing_maps = [#map], iterator_types = []} outs(%2 : tensor<f32>) {
        ^bb0(%out: f32):
          %extracted = tensor.extract %0[%c0] : tensor<2xf32>
          %6 = arith.mulf %extracted, %cst : f32
          %extracted_2 = tensor.extract %0[%c1] : tensor<2xf32>
          %7 = arith.mulf %extracted_2, %cst : f32
          %8 = arith.addf %6, %7 : f32
          %9 = arith.divf %8, %cst_0 : f32
          %10 = arith.subf %7, %6 : f32
          %11 = arith.divf %10, %cst_1 : f32
          %extracted_3 = tensor.extract %1[%c2] : tensor<3xf32>
          %12 = arith.divf %11, %cst_0 : f32
          %13 = arith.addf %extracted_3, %12 : f32
          %14 = math.cos %13 : f32
          %15 = arith.mulf %9, %14 : f32
          %extracted_4 = tensor.extract %1[%c0] : tensor<3xf32>
          %16 = arith.addf %extracted_4, %15 : f32
          linalg.yield %16 : f32
        } -> tensor<f32>
        %5 = linalg.generic {indexing_maps = [#map], iterator_types = []} outs(%2 : tensor<f32>) {
        ^bb0(%out: f32):
          %extracted = tensor.extract %0[%c0] : tensor<2xf32>
          %6 = arith.mulf %extracted, %cst : f32
          %extracted_2 = tensor.extract %0[%c1] : tensor<2xf32>
          %7 = arith.mulf %extracted_2, %cst : f32
          %8 = arith.subf %7, %6 : f32
          %9 = arith.divf %8, %cst_1 : f32
          %extracted_3 = tensor.extract %1[%c2] : tensor<3xf32>
          %10 = arith.addf %extracted_3, %9 : f32
          linalg.yield %10 : f32
        } -> tensor<f32>
        iree_tensor_ext.dispatch.tensor.store %5, %arg2, offsets = [], sizes = [], strides = [] : tensor<f32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>
        iree_tensor_ext.dispatch.tensor.store %4, %arg3, offsets = [], sizes = [], strides = [] : tensor<f32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>
        iree_tensor_ext.dispatch.tensor.store %3, %arg4, offsets = [], sizes = [], strides = [] : tensor<f32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>
        return
      }
    }
  }
  flow.executable private @main_graph$async_dispatch_1 {
    flow.executable.export public @main_graph$async_dispatch_1_slow_memcpy workgroups() -> (index, index, index) {
      %x, %y, %z = iree_tensor_ext.dispatch.workgroup_count_from_slice()
      flow.return %x, %y, %z : index, index, index
    }
    builtin.module {
      func.func @main_graph$async_dispatch_1_slow_memcpy(%arg0: !iree_tensor_ext.dispatch.tensor<readonly:tensor<3x64x64xf32>>, %arg1: !iree_tensor_ext.dispatch.tensor<readwrite:tensor<3x66x66xf32>>) {
        %0 = iree_tensor_ext.dispatch.tensor.load %arg0, offsets = [0, 0, 0], sizes = [3, 64, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<3x64x64xf32>> -> tensor<3x64x64xf32>
        iree_tensor_ext.dispatch.tensor.store %0, %arg1, offsets = [0, 1, 1], sizes = [3, 64, 64], strides = [1, 1, 1] : tensor<3x64x64xf32> -> !iree_tensor_ext.dispatch.tensor<readwrite:tensor<3x66x66xf32>>
        return
      }
    }
  }
  flow.executable private @main_graph$async_dispatch_2 {
    flow.executable.export public @main_graph$async_dispatch_2_conv_4x16x16x3x4x4_f32 workgroups() -> (index, index, index) {
      %x, %y, %z = iree_tensor_ext.dispatch.workgroup_count_from_slice()
      flow.return %x, %y, %z : index, index, index
    }
    builtin.module {
      func.func @main_graph$async_dispatch_2_conv_4x16x16x3x4x4_f32(%arg0: !iree_tensor_ext.dispatch.tensor<readonly:tensor<3x66x66xf32>>, %arg1: !iree_tensor_ext.dispatch.tensor<readonly:tensor<4x3x4x4xf32>>, %arg2: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<4x16x16xf32>>) {
        %cst = arith.constant 0.000000e+00 : f32
        %cst_0 = arith.constant dense<[-0.0291617829, 0.0185516253, -0.0336317755, 0.0323117375]> : tensor<4xf32>
        %0 = iree_tensor_ext.dispatch.tensor.load %arg0, offsets = [0, 0, 0], sizes = [3, 66, 66], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<3x66x66xf32>> -> tensor<3x66x66xf32>
        %1 = iree_tensor_ext.dispatch.tensor.load %arg1, offsets = [0, 0, 0, 0], sizes = [4, 3, 4, 4], strides = [1, 1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<4x3x4x4xf32>> -> tensor<4x3x4x4xf32>
        %2 = tensor.empty() : tensor<4x16x16xf32>
        %3 = linalg.fill ins(%cst : f32) outs(%2 : tensor<4x16x16xf32>) -> tensor<4x16x16xf32>
        %4 = linalg.generic {indexing_maps = [#map1, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "reduction", "reduction", "reduction"]} ins(%0, %1 : tensor<3x66x66xf32>, tensor<4x3x4x4xf32>) outs(%3 : tensor<4x16x16xf32>) {
        ^bb0(%in: f32, %in_1: f32, %out: f32):
          %6 = arith.mulf %in, %in_1 : f32
          %7 = arith.addf %out, %6 : f32
          linalg.yield %7 : f32
        } -> tensor<4x16x16xf32>
        %5 = linalg.generic {indexing_maps = [#map4, #map5, #map4], iterator_types = ["parallel", "parallel", "parallel"]} ins(%4, %cst_0 : tensor<4x16x16xf32>, tensor<4xf32>) outs(%2 : tensor<4x16x16xf32>) {
        ^bb0(%in: f32, %in_1: f32, %out: f32):
          %6 = arith.addf %in, %in_1 : f32
          %7 = arith.cmpf ugt, %6, %cst : f32
          %8 = arith.select %7, %6, %cst : f32
          linalg.yield %8 : f32
        } -> tensor<4x16x16xf32>
        iree_tensor_ext.dispatch.tensor.store %5, %arg2, offsets = [0, 0, 0], sizes = [4, 16, 16], strides = [1, 1, 1] : tensor<4x16x16xf32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<4x16x16xf32>>
        return
      }
    }
  }
  flow.executable private @main_graph$async_dispatch_3 {
    flow.executable.export public @main_graph$async_dispatch_3_conv_4x8x8x2x2_f32 workgroups() -> (index, index, index) {
      %x, %y, %z = iree_tensor_ext.dispatch.workgroup_count_from_slice()
      flow.return %x, %y, %z : index, index, index
    }
    builtin.module {
      func.func @main_graph$async_dispatch_3_conv_4x8x8x2x2_f32(%arg0: !iree_tensor_ext.dispatch.tensor<readonly:tensor<4x16x16xf32>>, %arg1: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<4x8x8xf32>>) {
        %cst = arith.constant 0xFF800000 : f32
        %0 = iree_tensor_ext.dispatch.tensor.load %arg0, offsets = [0, 0, 0], sizes = [4, 16, 16], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<4x16x16xf32>> -> tensor<4x16x16xf32>
        %1 = tensor.empty() : tensor<4x8x8xf32>
        %2 = tensor.empty() : tensor<2x2xf32>
        %3 = linalg.fill ins(%cst : f32) outs(%1 : tensor<4x8x8xf32>) -> tensor<4x8x8xf32>
        %4 = linalg.generic {indexing_maps = [#map6, #map7, #map8], iterator_types = ["parallel", "parallel", "parallel", "reduction", "reduction"]} ins(%0, %2 : tensor<4x16x16xf32>, tensor<2x2xf32>) outs(%3 : tensor<4x8x8xf32>) {
        ^bb0(%in: f32, %in_0: f32, %out: f32):
          %5 = arith.maximumf %out, %in : f32
          linalg.yield %5 : f32
        } -> tensor<4x8x8xf32>
        iree_tensor_ext.dispatch.tensor.store %4, %arg1, offsets = [0, 0, 0], sizes = [4, 8, 8], strides = [1, 1, 1] : tensor<4x8x8xf32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<4x8x8xf32>>
        return
      }
    }
  }
  flow.executable private @main_graph$async_dispatch_4 {
    flow.executable.export public @main_graph$async_dispatch_4_mmt4d_1x1x256x1x8x1_f32 workgroups() -> (index, index, index) {
      %x, %y, %z = iree_tensor_ext.dispatch.workgroup_count_from_slice()
      flow.return %x, %y, %z : index, index, index
    }
    builtin.module {
      func.func @main_graph$async_dispatch_4_mmt4d_1x1x256x1x8x1_f32(%arg0: !iree_tensor_ext.dispatch.tensor<readonly:tensor<1x256x1x1xf32>>, %arg1: !iree_tensor_ext.dispatch.tensor<readonly:tensor<1x256x8x1xf32>>, %arg2: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<1x1x1x8xf32>>) {
        %cst = arith.constant 0.000000e+00 : f32
        %0 = iree_tensor_ext.dispatch.tensor.load %arg0, offsets = [0, 0, 0, 0], sizes = [1, 256, 1, 1], strides = [1, 1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<1x256x1x1xf32>> -> tensor<1x256x1x1xf32>
        %1 = iree_tensor_ext.dispatch.tensor.load %arg1, offsets = [0, 0, 0, 0], sizes = [1, 256, 8, 1], strides = [1, 1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<1x256x8x1xf32>> -> tensor<1x256x8x1xf32>
        %2 = tensor.empty() : tensor<1x1x1x8xf32>
        %3 = linalg.fill ins(%cst : f32) outs(%2 : tensor<1x1x1x8xf32>) -> tensor<1x1x1x8xf32>
        %4 = linalg.mmt4d ins(%0, %1 : tensor<1x256x1x1xf32>, tensor<1x256x8x1xf32>) outs(%3 : tensor<1x1x1x8xf32>) -> tensor<1x1x1x8xf32>
        iree_tensor_ext.dispatch.tensor.store %4, %arg2, offsets = [0, 0, 0, 0], sizes = [1, 1, 1, 8], strides = [1, 1, 1, 1] : tensor<1x1x1x8xf32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<1x1x1x8xf32>>
        return
      }
    }
  }
  flow.executable private @main_graph$async_dispatch_5 {
    flow.executable.export public @main_graph$async_dispatch_5_elementwise_broadcast workgroups() -> (index, index, index) {
      %c1 = arith.constant 1 : index
      flow.return %c1, %c1, %c1 : index, index, index
    }
    builtin.module {
      func.func @main_graph$async_dispatch_5_elementwise_broadcast(%arg0: !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>>, %arg1: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>, %arg2: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>, %arg3: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>) {
        %c0 = arith.constant 0 : index
        %c1 = arith.constant 1 : index
        %0 = iree_tensor_ext.dispatch.tensor.load %arg0, offsets = [0], sizes = [2], strides = [1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>> -> tensor<2xf32>
        %1 = tensor.empty() : tensor<f32>
        %2 = linalg.generic {indexing_maps = [#map], iterator_types = []} outs(%1 : tensor<f32>) {
        ^bb0(%out: f32):
          %extracted = tensor.extract %0[%c0] : tensor<2xf32>
          %extracted_0 = tensor.extract %0[%c1] : tensor<2xf32>
          %5 = arith.addf %extracted, %extracted_0 : f32
          %6 = math.cos %5 : f32
          %7 = math.cos %extracted : f32
          %8 = arith.addf %7, %6 : f32
          linalg.yield %8 : f32
        } -> tensor<f32>
        %3 = linalg.generic {indexing_maps = [#map], iterator_types = []} outs(%1 : tensor<f32>) {
        ^bb0(%out: f32):
          %extracted = tensor.extract %0[%c0] : tensor<2xf32>
          %extracted_0 = tensor.extract %0[%c1] : tensor<2xf32>
          %5 = arith.addf %extracted, %extracted_0 : f32
          %6 = math.cos %5 : f32
          linalg.yield %6 : f32
        } -> tensor<f32>
        %4 = linalg.generic {indexing_maps = [#map], iterator_types = []} outs(%1 : tensor<f32>) {
        ^bb0(%out: f32):
          %extracted = tensor.extract %0[%c0] : tensor<2xf32>
          %extracted_0 = tensor.extract %0[%c1] : tensor<2xf32>
          %5 = arith.addf %extracted, %extracted_0 : f32
          %6 = math.sin %5 : f32
          %7 = math.sin %extracted : f32
          %8 = arith.addf %7, %6 : f32
          linalg.yield %8 : f32
        } -> tensor<f32>
        iree_tensor_ext.dispatch.tensor.store %4, %arg1, offsets = [], sizes = [], strides = [] : tensor<f32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>
        iree_tensor_ext.dispatch.tensor.store %3, %arg2, offsets = [], sizes = [], strides = [] : tensor<f32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>
        iree_tensor_ext.dispatch.tensor.store %2, %arg3, offsets = [], sizes = [], strides = [] : tensor<f32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>
        return
      }
    }
  }
  flow.executable private @main_graph$async_dispatch_6 {
    flow.executable.export public @main_graph$async_dispatch_6_unpack_elementwise_1x2_f32 workgroups() -> (index, index, index) {
      %x, %y, %z = iree_tensor_ext.dispatch.workgroup_count_from_slice()
      flow.return %x, %y, %z : index, index, index
    }
    builtin.module {
      func.func @main_graph$async_dispatch_6_unpack_elementwise_1x2_f32(%arg0: !iree_tensor_ext.dispatch.tensor<readonly:tensor<1x1x1x8xf32>>, %arg1: !iree_tensor_ext.dispatch.tensor<readonly:tensor<1x2xf32>>, %arg2: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<1x2xf32>>, %arg3: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<1x2xf32>>) {
        %cst = arith.constant dense<[[-0.0322122052, -0.0469594523]]> : tensor<1x2xf32>
        %0 = iree_tensor_ext.dispatch.tensor.load %arg0, offsets = [0, 0, 0, 0], sizes = [1, 1, 1, 8], strides = [1, 1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<1x1x1x8xf32>> -> tensor<1x1x1x8xf32>
        %1 = iree_tensor_ext.dispatch.tensor.load %arg1, offsets = [0, 0], sizes = [1, 2], strides = [1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<1x2xf32>> -> tensor<1x2xf32>
        %2 = tensor.empty() : tensor<1x2xf32>
        %unpack = linalg.unpack %0 outer_dims_perm = [0, 1] inner_dims_pos = [0, 1] inner_tiles = [1, 8] into %2 : tensor<1x1x1x8xf32> -> tensor<1x2xf32>
        %3:2 = linalg.generic {indexing_maps = [#map9, #map9, #map9, #map9, #map9], iterator_types = ["parallel", "parallel"]} ins(%unpack, %cst, %1 : tensor<1x2xf32>, tensor<1x2xf32>, tensor<1x2xf32>) outs(%2, %2 : tensor<1x2xf32>, tensor<1x2xf32>) {
        ^bb0(%in: f32, %in_0: f32, %in_1: f32, %out: f32, %out_2: f32):
          %4 = arith.addf %in, %in_0 : f32
          %5 = arith.subf %4, %in_1 : f32
          linalg.yield %4, %5 : f32, f32
        } -> (tensor<1x2xf32>, tensor<1x2xf32>)
        iree_tensor_ext.dispatch.tensor.store %3#0, %arg2, offsets = [0, 0], sizes = [1, 2], strides = [1, 1] : tensor<1x2xf32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<1x2xf32>>
        iree_tensor_ext.dispatch.tensor.store %3#1, %arg3, offsets = [0, 0], sizes = [1, 2], strides = [1, 1] : tensor<1x2xf32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<1x2xf32>>
        return
      }
    }
  }
  flow.executable private @main_graph$async_dispatch_7 {
    flow.executable.export public @main_graph$async_dispatch_7_elementwise_broadcast workgroups() -> (index, index, index) {
      %c1 = arith.constant 1 : index
      flow.return %c1, %c1, %c1 : index, index, index
    }
    builtin.module {
      func.func @main_graph$async_dispatch_7_elementwise_broadcast(%arg0: !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>>, %arg1: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>, %arg2: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>) {
        %cst = arith.constant -1.000000e+00 : f32
        %c0 = arith.constant 0 : index
        %c1 = arith.constant 1 : index
        %0 = iree_tensor_ext.dispatch.tensor.load %arg0, offsets = [0], sizes = [2], strides = [1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>> -> tensor<2xf32>
        %1 = tensor.empty() : tensor<f32>
        %2 = linalg.generic {indexing_maps = [#map], iterator_types = []} outs(%1 : tensor<f32>) {
        ^bb0(%out: f32):
          %extracted = tensor.extract %0[%c0] : tensor<2xf32>
          %extracted_0 = tensor.extract %0[%c1] : tensor<2xf32>
          %4 = arith.addf %extracted, %extracted_0 : f32
          %5 = math.sin %4 : f32
          %6 = math.sin %extracted : f32
          %7 = arith.mulf %6, %cst : f32
          %8 = arith.subf %7, %5 : f32
          linalg.yield %8 : f32
        } -> tensor<f32>
        %3 = linalg.generic {indexing_maps = [#map], iterator_types = []} outs(%1 : tensor<f32>) {
        ^bb0(%out: f32):
          %extracted = tensor.extract %0[%c0] : tensor<2xf32>
          %extracted_0 = tensor.extract %0[%c1] : tensor<2xf32>
          %4 = arith.addf %extracted, %extracted_0 : f32
          %5 = math.sin %4 : f32
          %6 = arith.mulf %5, %cst : f32
          linalg.yield %6 : f32
        } -> tensor<f32>
        iree_tensor_ext.dispatch.tensor.store %3, %arg1, offsets = [], sizes = [], strides = [] : tensor<f32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>
        iree_tensor_ext.dispatch.tensor.store %2, %arg2, offsets = [], sizes = [], strides = [] : tensor<f32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>
        return
      }
    }
  }
  flow.executable private @main_graph$async_dispatch_8 {
    flow.executable.export public @main_graph$async_dispatch_8_elementwise_broadcast_2_f32 workgroups() -> (index, index, index) {
      %x, %y, %z = iree_tensor_ext.dispatch.workgroup_count_from_slice()
      flow.return %x, %y, %z : index, index, index
    }
    builtin.module {
      func.func @main_graph$async_dispatch_8_elementwise_broadcast_2_f32(%arg0: !iree_tensor_ext.dispatch.tensor<readonly:tensor<2x2xf32>>, %arg1: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<2xf32>>) {
        %c0 = arith.constant 0 : index
        %0 = iree_tensor_ext.dispatch.tensor.load %arg0, offsets = [0, 0], sizes = [2, 2], strides = [1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<2x2xf32>> -> tensor<2x2xf32>
        %1 = tensor.empty() : tensor<2xf32>
        %2 = linalg.generic {indexing_maps = [#map10], iterator_types = ["parallel"]} outs(%1 : tensor<2xf32>) {
        ^bb0(%out: f32):
          %3 = linalg.index 0 : index
          %extracted = tensor.extract %0[%c0, %3] : tensor<2x2xf32>
          linalg.yield %extracted : f32
        } -> tensor<2xf32>
        iree_tensor_ext.dispatch.tensor.store %2, %arg1, offsets = [0], sizes = [2], strides = [1] : tensor<2xf32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<2xf32>>
        return
      }
    }
  }
  flow.executable private @main_graph$async_dispatch_9 {
    flow.executable.export public @main_graph$async_dispatch_9_elementwise_broadcast workgroups() -> (index, index, index) {
      %c1 = arith.constant 1 : index
      flow.return %c1, %c1, %c1 : index, index, index
    }
    builtin.module {
      func.func @main_graph$async_dispatch_9_elementwise_broadcast(%arg0: !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>>, %arg1: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>) {
        %c0 = arith.constant 0 : index
        %0 = iree_tensor_ext.dispatch.tensor.load %arg0, offsets = [0], sizes = [2], strides = [1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>> -> tensor<2xf32>
        %1 = tensor.empty() : tensor<f32>
        %2 = linalg.generic {indexing_maps = [#map], iterator_types = []} outs(%1 : tensor<f32>) {
        ^bb0(%out: f32):
          %extracted = tensor.extract %0[%c0] : tensor<2xf32>
          linalg.yield %extracted : f32
        } -> tensor<f32>
        iree_tensor_ext.dispatch.tensor.store %2, %arg1, offsets = [], sizes = [], strides = [] : tensor<f32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>
        return
      }
    }
  }
  flow.executable private @main_graph$async_dispatch_10 {
    flow.executable.export public @main_graph$async_dispatch_10_elementwise_broadcast_2_f32 workgroups() -> (index, index, index) {
      %x, %y, %z = iree_tensor_ext.dispatch.workgroup_count_from_slice()
      flow.return %x, %y, %z : index, index, index
    }
    builtin.module {
      func.func @main_graph$async_dispatch_10_elementwise_broadcast_2_f32(%arg0: !iree_tensor_ext.dispatch.tensor<readonly:tensor<2x2xf32>>, %arg1: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<2xf32>>) {
        %c1 = arith.constant 1 : index
        %0 = iree_tensor_ext.dispatch.tensor.load %arg0, offsets = [0, 0], sizes = [2, 2], strides = [1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<2x2xf32>> -> tensor<2x2xf32>
        %1 = tensor.empty() : tensor<2xf32>
        %2 = linalg.generic {indexing_maps = [#map10], iterator_types = ["parallel"]} outs(%1 : tensor<2xf32>) {
        ^bb0(%out: f32):
          %3 = linalg.index 0 : index
          %extracted = tensor.extract %0[%c1, %3] : tensor<2x2xf32>
          linalg.yield %extracted : f32
        } -> tensor<2xf32>
        iree_tensor_ext.dispatch.tensor.store %2, %arg1, offsets = [0], sizes = [2], strides = [1] : tensor<2xf32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<2xf32>>
        return
      }
    }
  }
  flow.executable private @main_graph$async_dispatch_11 {
    flow.executable.export public @main_graph$async_dispatch_11_elementwise_broadcast workgroups() -> (index, index, index) {
      %c1 = arith.constant 1 : index
      flow.return %c1, %c1, %c1 : index, index, index
    }
    builtin.module {
      func.func @main_graph$async_dispatch_11_elementwise_broadcast(%arg0: !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>>, %arg1: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>) {
        %c1 = arith.constant 1 : index
        %0 = iree_tensor_ext.dispatch.tensor.load %arg0, offsets = [0], sizes = [2], strides = [1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>> -> tensor<2xf32>
        %1 = tensor.empty() : tensor<f32>
        %2 = linalg.generic {indexing_maps = [#map], iterator_types = []} outs(%1 : tensor<f32>) {
        ^bb0(%out: f32):
          %extracted = tensor.extract %0[%c1] : tensor<2xf32>
          linalg.yield %extracted : f32
        } -> tensor<f32>
        iree_tensor_ext.dispatch.tensor.store %2, %arg1, offsets = [], sizes = [], strides = [] : tensor<f32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>
        return
      }
    }
  }
  flow.executable private @main_graph$async_dispatch_12 {
    flow.executable.export public @main_graph$async_dispatch_12_elementwise_broadcast workgroups() -> (index, index, index) {
      %c1 = arith.constant 1 : index
      flow.return %c1, %c1, %c1 : index, index, index
    }
    builtin.module {
      func.func @main_graph$async_dispatch_12_elementwise_broadcast(%arg0: !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>>, %arg1: !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>>, %arg2: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>) {
        %c1 = arith.constant 1 : index
        %0 = iree_tensor_ext.dispatch.tensor.load %arg0, offsets = [0], sizes = [2], strides = [1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>> -> tensor<2xf32>
        %1 = tensor.empty() : tensor<f32>
        %2 = linalg.generic {indexing_maps = [#map], iterator_types = []} outs(%1 : tensor<f32>) {
        ^bb0(%out: f32):
          %extracted = tensor.extract %0[%c1] : tensor<2xf32>
          %3 = arith.negf %extracted : f32
          linalg.yield %3 : f32
        } -> tensor<f32>
        iree_tensor_ext.dispatch.tensor.store %2, %arg2, offsets = [], sizes = [], strides = [] : tensor<f32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>
        return
      }
    }
  }
  flow.executable private @main_graph$async_dispatch_13 {
    flow.executable.export public @main_graph$async_dispatch_13_elementwise_broadcast workgroups() -> (index, index, index) {
      %c1 = arith.constant 1 : index
      flow.return %c1, %c1, %c1 : index, index, index
    }
    builtin.module {
      func.func @main_graph$async_dispatch_13_elementwise_broadcast(%arg0: !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>>, %arg1: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>) {
        %c0 = arith.constant 0 : index
        %0 = iree_tensor_ext.dispatch.tensor.load %arg0, offsets = [0], sizes = [2], strides = [1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>> -> tensor<2xf32>
        %1 = tensor.empty() : tensor<f32>
        %2 = linalg.generic {indexing_maps = [#map], iterator_types = []} outs(%1 : tensor<f32>) {
        ^bb0(%out: f32):
          %extracted = tensor.extract %0[%c0] : tensor<2xf32>
          %3 = arith.negf %extracted : f32
          linalg.yield %3 : f32
        } -> tensor<f32>
        iree_tensor_ext.dispatch.tensor.store %2, %arg1, offsets = [], sizes = [], strides = [] : tensor<f32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>
        return
      }
    }
  }
  flow.executable private @main_graph$async_dispatch_14 {
    flow.executable.export public @main_graph$async_dispatch_14_elementwise_2x2_f32_pack workgroups() -> (index, index, index) {
      %x, %y, %z = iree_tensor_ext.dispatch.workgroup_count_from_slice()
      flow.return %x, %y, %z : index, index, index
    }
    builtin.module {
      func.func @main_graph$async_dispatch_14_elementwise_2x2_f32_pack(%arg0: !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>>, %arg1: !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>>, %arg2: !iree_tensor_ext.dispatch.tensor<readonly:tensor<2x2xf32>>, %arg3: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<1x2x8x1xf32>>) {
        %cst = arith.constant 9.99999997E-7 : f32
        %cst_0 = arith.constant 0.000000e+00 : f32
        %cst_1 = arith.constant 1.000000e+00 : f32
        %c0 = arith.constant 0 : index
        %c1 = arith.constant 1 : index
        %0 = iree_tensor_ext.dispatch.tensor.load %arg0, offsets = [0], sizes = [2], strides = [1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>> -> tensor<2xf32>
        %1 = iree_tensor_ext.dispatch.tensor.load %arg1, offsets = [0], sizes = [2], strides = [1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>> -> tensor<2xf32>
        %2 = iree_tensor_ext.dispatch.tensor.load %arg2, offsets = [0, 0], sizes = [2, 2], strides = [1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<2x2xf32>> -> tensor<2x2xf32>
        %3 = tensor.empty() : tensor<1x2x8x1xf32>
        %4 = tensor.empty() : tensor<2x2xf32>
        %5 = linalg.generic {indexing_maps = [#map9, #map9], iterator_types = ["parallel", "parallel"]} ins(%2 : tensor<2x2xf32>) outs(%4 : tensor<2x2xf32>) {
        ^bb0(%in: f32, %out: f32):
          %extracted = tensor.extract %0[%c0] : tensor<2xf32>
          %extracted_2 = tensor.extract %1[%c1] : tensor<2xf32>
          %extracted_3 = tensor.extract %0[%c1] : tensor<2xf32>
          %extracted_4 = tensor.extract %1[%c0] : tensor<2xf32>
          %6 = arith.mulf %extracted_3, %extracted_4 : f32
          %7 = arith.mulf %extracted, %extracted_2 : f32
          %8 = arith.subf %7, %6 : f32
          %9 = arith.addf %8, %cst : f32
          %10 = arith.divf %cst_1, %9 : f32
          %11 = arith.mulf %in, %10 : f32
          linalg.yield %11 : f32
        } -> tensor<2x2xf32>
        %pack = linalg.pack %5 padding_value(%cst_0 : f32) outer_dims_perm = [0, 1] inner_dims_pos = [0, 1] inner_tiles = [8, 1] into %3 : tensor<2x2xf32> -> tensor<1x2x8x1xf32>
        iree_tensor_ext.dispatch.tensor.store %pack, %arg3, offsets = [0, 0, 0, 0], sizes = [1, 2, 8, 1], strides = [1, 1, 1, 1] : tensor<1x2x8x1xf32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<1x2x8x1xf32>>
        return
      }
    }
  }
  flow.executable private @main_graph$async_dispatch_15 {
    flow.executable.export public @main_graph$async_dispatch_15_mmt4d_1x1x2x1x8x1_f32 workgroups() -> (index, index, index) {
      %x, %y, %z = iree_tensor_ext.dispatch.workgroup_count_from_slice()
      flow.return %x, %y, %z : index, index, index
    }
    builtin.module {
      func.func @main_graph$async_dispatch_15_mmt4d_1x1x2x1x8x1_f32(%arg0: !iree_tensor_ext.dispatch.tensor<readonly:tensor<1x2x1x1xf32>>, %arg1: !iree_tensor_ext.dispatch.tensor<readonly:tensor<1x2x8x1xf32>>, %arg2: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<1x1x1x8xf32>>) {
        %cst = arith.constant 0.000000e+00 : f32
        %0 = iree_tensor_ext.dispatch.tensor.load %arg0, offsets = [0, 0, 0, 0], sizes = [1, 2, 1, 1], strides = [1, 1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<1x2x1x1xf32>> -> tensor<1x2x1x1xf32>
        %1 = iree_tensor_ext.dispatch.tensor.load %arg1, offsets = [0, 0, 0, 0], sizes = [1, 2, 8, 1], strides = [1, 1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<1x2x8x1xf32>> -> tensor<1x2x8x1xf32>
        %2 = tensor.empty() : tensor<1x1x1x8xf32>
        %3 = linalg.fill ins(%cst : f32) outs(%2 : tensor<1x1x1x8xf32>) -> tensor<1x1x1x8xf32>
        %4 = linalg.mmt4d ins(%0, %1 : tensor<1x2x1x1xf32>, tensor<1x2x8x1xf32>) outs(%3 : tensor<1x1x1x8xf32>) -> tensor<1x1x1x8xf32>
        iree_tensor_ext.dispatch.tensor.store %4, %arg2, offsets = [0, 0, 0, 0], sizes = [1, 1, 1, 8], strides = [1, 1, 1, 1] : tensor<1x1x1x8xf32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<1x1x1x8xf32>>
        return
      }
    }
  }
  flow.executable private @main_graph$async_dispatch_16 {
    flow.executable.export public @main_graph$async_dispatch_16_unpack_elementwise_2_f32 workgroups() -> (index, index, index) {
      %x, %y, %z = iree_tensor_ext.dispatch.workgroup_count_from_slice()
      flow.return %x, %y, %z : index, index, index
    }
    builtin.module {
      func.func @main_graph$async_dispatch_16_unpack_elementwise_2_f32(%arg0: !iree_tensor_ext.dispatch.tensor<readonly:tensor<1x8xf32>>, %arg1: !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>>, %arg2: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<2xf32>>) {
        %cst = arith.constant 1.000000e-01 : f32
        %0 = iree_tensor_ext.dispatch.tensor.load %arg0, offsets = [0, 0], sizes = [1, 8], strides = [1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<1x8xf32>> -> tensor<1x8xf32>
        %1 = iree_tensor_ext.dispatch.tensor.load %arg1, offsets = [0], sizes = [2], strides = [1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>> -> tensor<2xf32>
        %2 = tensor.empty() : tensor<2xf32>
        %unpack = linalg.unpack %0 outer_dims_perm = [0] inner_dims_pos = [0] inner_tiles = [8] into %2 : tensor<1x8xf32> -> tensor<2xf32>
        %3 = linalg.generic {indexing_maps = [#map10, #map10, #map10], iterator_types = ["parallel"]} ins(%1, %unpack : tensor<2xf32>, tensor<2xf32>) outs(%2 : tensor<2xf32>) {
        ^bb0(%in: f32, %in_0: f32, %out: f32):
          %4 = arith.mulf %in_0, %cst : f32
          %5 = arith.addf %in, %4 : f32
          linalg.yield %5 : f32
        } -> tensor<2xf32>
        iree_tensor_ext.dispatch.tensor.store %3, %arg2, offsets = [0], sizes = [2], strides = [1] : tensor<2xf32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<2xf32>>
        return
      }
    }
  }
  flow.executable private @main_graph$async_dispatch_18 {
    flow.executable.export public @main_graph$async_dispatch_18_elementwise_2_f32 workgroups() -> (index, index, index) {
      %x, %y, %z = iree_tensor_ext.dispatch.workgroup_count_from_slice()
      flow.return %x, %y, %z : index, index, index
    }
    builtin.module {
      func.func @main_graph$async_dispatch_18_elementwise_2_f32(%arg0: !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>>, %arg1: !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>>, %arg2: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<2xf32>>) {
        %0 = iree_tensor_ext.dispatch.tensor.load %arg0, offsets = [0], sizes = [2], strides = [1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>> -> tensor<2xf32>
        %1 = iree_tensor_ext.dispatch.tensor.load %arg1, offsets = [0], sizes = [2], strides = [1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>> -> tensor<2xf32>
        %2 = tensor.empty() : tensor<2xf32>
        %3 = linalg.generic {indexing_maps = [#map10, #map10, #map10], iterator_types = ["parallel"]} ins(%0, %1 : tensor<2xf32>, tensor<2xf32>) outs(%2 : tensor<2xf32>) {
        ^bb0(%in: f32, %in_0: f32, %out: f32):
          %4 = arith.subf %in, %in_0 : f32
          linalg.yield %4 : f32
        } -> tensor<2xf32>
        iree_tensor_ext.dispatch.tensor.store %3, %arg2, offsets = [0], sizes = [2], strides = [1] : tensor<2xf32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<2xf32>>
        return
      }
    }
  }
  flow.executable private @main_graph$async_dispatch_113 {
    flow.executable.export public @main_graph$async_dispatch_113_elementwise_broadcast workgroups() -> (index, index, index) {
      %c1 = arith.constant 1 : index
      flow.return %c1, %c1, %c1 : index, index, index
    }
    builtin.module {
      func.func @main_graph$async_dispatch_113_elementwise_broadcast(%arg0: !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>>, %arg1: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>, %arg2: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>) {
        %c0 = arith.constant 0 : index
        %c1 = arith.constant 1 : index
        %0 = iree_tensor_ext.dispatch.tensor.load %arg0, offsets = [0], sizes = [2], strides = [1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>> -> tensor<2xf32>
        %1 = tensor.empty() : tensor<f32>
        %2 = linalg.generic {indexing_maps = [#map], iterator_types = []} outs(%1 : tensor<f32>) {
        ^bb0(%out: f32):
          %extracted = tensor.extract %0[%c0] : tensor<2xf32>
          %extracted_0 = tensor.extract %0[%c1] : tensor<2xf32>
          %4 = arith.addf %extracted, %extracted_0 : f32
          %5 = math.cos %4 : f32
          %6 = math.cos %extracted : f32
          %7 = arith.addf %6, %5 : f32
          linalg.yield %7 : f32
        } -> tensor<f32>
        %3 = linalg.generic {indexing_maps = [#map], iterator_types = []} outs(%1 : tensor<f32>) {
        ^bb0(%out: f32):
          %extracted = tensor.extract %0[%c0] : tensor<2xf32>
          %extracted_0 = tensor.extract %0[%c1] : tensor<2xf32>
          %4 = arith.addf %extracted, %extracted_0 : f32
          %5 = math.sin %4 : f32
          %6 = math.sin %extracted : f32
          %7 = arith.addf %6, %5 : f32
          linalg.yield %7 : f32
        } -> tensor<f32>
        iree_tensor_ext.dispatch.tensor.store %3, %arg1, offsets = [], sizes = [], strides = [] : tensor<f32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>
        iree_tensor_ext.dispatch.tensor.store %2, %arg2, offsets = [], sizes = [], strides = [] : tensor<f32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<f32>>
        return
      }
    }
  }
  flow.executable private @main_graph$async_dispatch_114 {
    flow.executable.export public @main_graph$async_dispatch_114_elementwise_2_f32 workgroups() -> (index, index, index) {
      %x, %y, %z = iree_tensor_ext.dispatch.workgroup_count_from_slice()
      flow.return %x, %y, %z : index, index, index
    }
    builtin.module {
      func.func @main_graph$async_dispatch_114_elementwise_2_f32(%arg0: !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>>, %arg1: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<2xf32>>) {
        %cst = arith.constant dense<[-2.000000e-01, 0.000000e+00]> : tensor<2xf32>
        %0 = iree_tensor_ext.dispatch.tensor.load %arg0, offsets = [0], sizes = [2], strides = [1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>> -> tensor<2xf32>
        %1 = tensor.empty() : tensor<2xf32>
        %2 = linalg.generic {indexing_maps = [#map10, #map10, #map10], iterator_types = ["parallel"]} ins(%0, %cst : tensor<2xf32>, tensor<2xf32>) outs(%1 : tensor<2xf32>) {
        ^bb0(%in: f32, %in_0: f32, %out: f32):
          %3 = arith.addf %in, %in_0 : f32
          linalg.yield %3 : f32
        } -> tensor<2xf32>
        iree_tensor_ext.dispatch.tensor.store %2, %arg1, offsets = [0], sizes = [2], strides = [1] : tensor<2xf32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<2xf32>>
        return
      }
    }
  }
  flow.executable private @main_graph$async_dispatch_115 {
    flow.executable.export public @main_graph$async_dispatch_115_elementwise_broadcast_10x2_f32 workgroups() -> (index, index, index) {
      %x, %y, %z = iree_tensor_ext.dispatch.workgroup_count_from_slice()
      flow.return %x, %y, %z : index, index, index
    }
    builtin.module {
      func.func @main_graph$async_dispatch_115_elementwise_broadcast_10x2_f32(%arg0: !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>>, %arg1: !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>>, %arg2: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<10x2xf32>>) {
        %cst = arith.constant dense<[1.000000e+00, 0.888888895, 0.777777791, 0.666666627, 0.555555582, 0.444444418, 0.333333313, 0.222222209, 0.111111104, 0.000000e+00]> : tensor<10xf32>
        %cst_0 = arith.constant dense<[0.000000e+00, 0.111111112, 0.222222224, 0.333333343, 0.444444448, 0.555555582, 0.666666686, 0.777777791, 0.888888895, 1.000000e+00]> : tensor<10xf32>
        %0 = iree_tensor_ext.dispatch.tensor.load %arg0, offsets = [0], sizes = [2], strides = [1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>> -> tensor<2xf32>
        %1 = iree_tensor_ext.dispatch.tensor.load %arg1, offsets = [0], sizes = [2], strides = [1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>> -> tensor<2xf32>
        %2 = tensor.empty() : tensor<10x2xf32>
        %3 = linalg.generic {indexing_maps = [#map11, #map12, #map11, #map12, #map9], iterator_types = ["parallel", "parallel"]} ins(%0, %cst, %1, %cst_0 : tensor<2xf32>, tensor<10xf32>, tensor<2xf32>, tensor<10xf32>) outs(%2 : tensor<10x2xf32>) {
        ^bb0(%in: f32, %in_1: f32, %in_2: f32, %in_3: f32, %out: f32):
          %4 = arith.mulf %in_2, %in_3 : f32
          %5 = arith.mulf %in, %in_1 : f32
          %6 = arith.addf %5, %4 : f32
          linalg.yield %6 : f32
        } -> tensor<10x2xf32>
        iree_tensor_ext.dispatch.tensor.store %3, %arg2, offsets = [0, 0], sizes = [10, 2], strides = [1, 1] : tensor<10x2xf32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<10x2xf32>>
        return
      }
    }
  }
  flow.executable private @main_graph$async_dispatch_116 {
    flow.executable.export public @main_graph$async_dispatch_116_elementwise_broadcast_9x2_f32 workgroups() -> (index, index, index) {
      %x, %y, %z = iree_tensor_ext.dispatch.workgroup_count_from_slice()
      flow.return %x, %y, %z : index, index, index
    }
    builtin.module {
      func.func @main_graph$async_dispatch_116_elementwise_broadcast_9x2_f32(%arg0: !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>>, %arg1: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<9x2xf32>>) {
        %cst = arith.constant dense<[1.000000e+00, 0.888888895, 0.777777791, 0.666666627, 0.555555582, 0.444444418, 0.333333313, 0.222222209, 0.111111104, 0.000000e+00]> : tensor<10xf32>
        %cst_0 = arith.constant dense<[0.000000e+00, -1.000000e-01]> : tensor<2xf32>
        %cst_1 = arith.constant dense<[0.000000e+00, 0.111111112, 0.222222224, 0.333333343, 0.444444448, 0.555555582, 0.666666686, 0.777777791, 0.888888895, 1.000000e+00]> : tensor<10xf32>
        %0 = iree_tensor_ext.dispatch.tensor.load %arg0, offsets = [0], sizes = [2], strides = [1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<2xf32>> -> tensor<2xf32>
        %1 = tensor.empty() : tensor<9x2xf32>
        %extracted_slice = tensor.extract_slice %cst[1] [9] [1] : tensor<10xf32> to tensor<9xf32>
        %extracted_slice_2 = tensor.extract_slice %cst_1[1] [9] [1] : tensor<10xf32> to tensor<9xf32>
        %2 = linalg.generic {indexing_maps = [#map11, #map12, #map11, #map12, #map9], iterator_types = ["parallel", "parallel"]} ins(%0, %extracted_slice, %cst_0, %extracted_slice_2 : tensor<2xf32>, tensor<9xf32>, tensor<2xf32>, tensor<9xf32>) outs(%1 : tensor<9x2xf32>) {
        ^bb0(%in: f32, %in_3: f32, %in_4: f32, %in_5: f32, %out: f32):
          %3 = arith.addf %in, %in_4 : f32
          %4 = arith.mulf %3, %in_5 : f32
          %5 = arith.mulf %in, %in_3 : f32
          %6 = arith.addf %5, %4 : f32
          linalg.yield %6 : f32
        } -> tensor<9x2xf32>
        iree_tensor_ext.dispatch.tensor.store %2, %arg1, offsets = [0, 0], sizes = [9, 2], strides = [1, 1] : tensor<9x2xf32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<9x2xf32>>
        return
      }
    }
  }
  util.global private @__constant_tensor_4x3x4x4xf32 {inlining_policy = #util.inline.never, stream.affinity.default = #hal.device.affinity<@__device_0>} = dense<"0xA4E062BD6F10A2BDF988443C9D175DBDC10D0BBEE2788DBD3D23A9BD501B7A3DA06B673DC090123EF900C63D2A100ABEC0E7D43D7E941CBC25580B3ECD8EBABD075D0E3EA3222C3D1ADEF53D6FAFC0BCE158683DC8F0F03BAD63CBBD0E57183DBEEE97BDDAE7F3BA769EDC3C7374EB3D4E39B33D106142BD382EA7BC892A01BEC026C63D1087BB3DA69D783D32427B3D4213F93D30DA0CBEC15A803DF17AB63D8A1A043EB867E7BDC529363D951A0CBE2FA62C3B565E043E93A9C5BC14469A3B0C6CA6BD2E66EEBD108FEDBDF4DAAA3DF64DA6BD55D2463C0EAE90BD2ECE43BD0402B7BD4844D8BC6FEF45BD8F289ABD724E2DBD35E2F53DD861BDBD345DAF3DBCD10E3E38A27F3C7362293D0C6787BD20FA3CBD035807BE2FA4EEBD66790DBCE11EA53DFADE123EB6D10C3E0BBD13BE6545C63D6335D93D3D61033E6D6313BDFDE110BE6E7C403DBF1E653BF4A2603D250A513D106844BD843DA53D1EE2823DECBBC4BD3035AFBC2A51A63D959BB63D03F5183D25A672BDE20DE33DEA84133EB5EFB1BC290708BEBC93E9BB850E793BAD14FDBDE95801BE330F883DD6C4E83DF8E2F0BD204E84BDFE1802BEC88B8A3C4F33AA3D706DA93CB7B0EF3D6DA8E9BD819AE23D24AF903DC74412BE545F0A3E52894C3D993BAC3D01D7453DAB55D03D34A2373DDDAD8CBD9FFE25BDBEF4CB3D3B399BBDE380CEBD195A2CBD5990CDBDC062AEBDBEE2E2BD96D8543D963567BC07AFE23CE3069F3D99A7013EF655EEBDE95BB5BB57B72BBD1A3AEDBD6ED50C3EA362E2BDBAE2BD3C7886133E4D0F7E3C3EA8F93CAA7AECBD0B22933BF532A0BD3CEE07BE9653ADBD3F8FA6BD9D507EBC8FF6C0BC19C801BE67E590BDA26D3FBC72EEA33D0902DE3D12F202BE97988B3D4FFB15BCD53E803DC446B9BC82C31B3D47FFD4BD581A843D8623133EE83DB6BD58094ABDDC2CE23DEDBC133E3172CE3D21125EBD29347B3D386DFBBDD03723BD11A8B4396362003ECBE981BC8A04A5BC947CC43DA4E7873DC3AFF8BC490EDF3CD3388BBDC1773B3D12F16FBDBECEE1BDB86F18BDB030243CD6E4E2BDCF2D7B3C"> : tensor<4x3x4x4xf32>
