; ModuleID = 'fastdepth_linked'
source_filename = "fastdepth_linked"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%iree_hal_executable_library_header_t = type { i32, ptr, i32, i32 }
%iree_hal_executable_dispatch_attrs_v0_t = type { i64, i16, i8, i8, i32, i32, i16, i16, i64, i64, i64, i64, i64 }
%iree_hal_executable_source_location_v0_t = type { i32, i32, ptr }
%iree_hal_executable_stage_location_table_v0_t = type { i32, ptr, ptr }
%iree_hal_executable_library_v0_t = type { ptr, %iree_hal_executable_import_table_v0_t, %iree_hal_executable_export_table_v0_t, %iree_hal_executable_constant_table_v0_t, %iree_hal_executable_source_file_table_v0_t }
%iree_hal_executable_import_table_v0_t = type { i32, ptr }
%iree_hal_executable_export_table_v0_t = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%iree_hal_executable_constant_table_v0_t = type { i32 }
%iree_hal_executable_source_file_table_v0_t = type { i32, ptr }
%iree_hal_executable_dispatch_state_v0_t = type { i32, i32, i16, i16, i32, i32, i16, i8, i8, ptr, ptr, ptr }
%iree_hal_executable_workgroup_state_v0_t = type { i32, i32, i16, i16, i32, ptr, i32 }


!48 = distinct !DICompileUnit(language: DW_LANG_C17, file: !49, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!49 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_32.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!50 = distinct !DICompileUnit(language: DW_LANG_C17, file: !51, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!51 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_33.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!52 = distinct !DICompileUnit(language: DW_LANG_C17, file: !53, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!53 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_34.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!54 = distinct !DICompileUnit(language: DW_LANG_C17, file: !55, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!55 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_35.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!56 = distinct !DICompileUnit(language: DW_LANG_C17, file: !57, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!57 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_36.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!58 = distinct !DICompileUnit(language: DW_LANG_C17, file: !59, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!59 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_37.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!60 = distinct !DICompileUnit(language: DW_LANG_C17, file: !61, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!61 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_38.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!62 = distinct !DICompileUnit(language: DW_LANG_C17, file: !63, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!63 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_39.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!64 = distinct !DICompileUnit(language: DW_LANG_C17, file: !65, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!65 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_40.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!66 = distinct !DICompileUnit(language: DW_LANG_C17, file: !67, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!67 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_41.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!68 = distinct !DICompileUnit(language: DW_LANG_C17, file: !69, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!69 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_42.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!70 = distinct !DICompileUnit(language: DW_LANG_C17, file: !71, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!71 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_43.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!72 = distinct !DICompileUnit(language: DW_LANG_C17, file: !73, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!73 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_44.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!74 = distinct !DICompileUnit(language: DW_LANG_C17, file: !75, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!75 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_45.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!76 = !{i32 2, !"Debug Info Version", i32 3}
!77 = distinct !DISubprogram(name: "main_graph$async_dispatch_0_slow_memcpy", linkageName: "main_graph$async_dispatch_0_slow_memcpy", scope: !1, file: !1, line: 1, type: !78, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0)
!78 = !DISubroutineType(cc: DW_CC_normal, types: !79)
!79 = !{!80, !81, !112, !141}
!80 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "iree_hal_executable_environment_v0_t", baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_executable_environment_v0_t", scope: !85, file: !85, line: 246, size: 768, elements: !86)
!85 = !DIFile(filename: "runtime/src/iree/hal/local/executable_library.h", directory: ".")
!86 = !{!87, !95, !98, !101, !103}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "constants", baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!90 = !DICompositeType(tag: DW_TAG_array_type, scope: !85, file: !85, line: 227, baseType: !91, size: 2048, elements: !93)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", baseType: !92)
!92 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!93 = !{!94}
!94 = !DISubrange(count: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "import_thunk", baseType: !96, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIBasicType(name: "void", encoding: DW_ATE_address)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "import_funcs", baseType: !99, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "import_contexts", baseType: !102, size: 64, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "processor", baseType: !104, offset: 256)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_processor_v0_t", scope: !85, file: !85, line: 227, size: 512, elements: !105)
!105 = !{!106}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "data", baseType: !107)
!107 = !DICompositeType(tag: DW_TAG_array_type, scope: !85, file: !85, line: 227, baseType: !108, size: 512, elements: !110)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", baseType: !109)
!109 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!110 = !{!111}
!111 = !DISubrange(count: 8)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "iree_hal_executable_dispatch_state_v0_t", baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_executable_dispatch_state_v0_t", scope: !85, file: !85, line: 275, size: 384, elements: !116)
!116 = !{!117, !118, !119, !122, !123, !124, !125, !126, !129, !130, !131, !136}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_size_x", baseType: !91, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_size_y", baseType: !91, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_size_z", baseType: !120, size: 16, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", baseType: !121)
!121 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "constant_count", baseType: !120, size: 16, offset: 80)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_count_x", baseType: !91, size: 32, offset: 96)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_count_y", baseType: !91, size: 32, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_count_z", baseType: !120, size: 16, offset: 160)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "max_concurrency", baseType: !127, size: 8, offset: 176)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", baseType: !128)
!128 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "binding_count", baseType: !127, size: 8, offset: 184)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "constants", baseType: !88, size: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "binding_ptrs", baseType: !132, size: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DICompositeType(tag: DW_TAG_array_type, scope: !85, file: !85, line: 227, baseType: !135, size: 4096, elements: !93)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "binding_lengths", baseType: !137, size: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!139 = !DICompositeType(tag: DW_TAG_array_type, scope: !85, file: !85, line: 227, baseType: !140, size: 4096, elements: !93)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", baseType: !108)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "iree_hal_executable_workgroup_state_v0_t", baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_executable_workgroup_state_v0_t", scope: !85, file: !85, line: 321, size: 256, elements: !145)
!145 = !{!146, !147, !148, !149, !150, !151, !152}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_id_x", baseType: !91, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_id_y", baseType: !91, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_id_z", baseType: !120, size: 16, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", baseType: !120, size: 16, offset: 80)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "processor_id", baseType: !91, size: 32, offset: 96)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "local_memory", baseType: !96, size: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "local_memory_size", baseType: !91, size: 32, offset: 192)
!153 = !DILocation(line: 10, column: 8, scope: !77)
!154 = !DILocation(line: 11, column: 8, scope: !77)
!155 = !DILocation(line: 12, column: 8, scope: !77)
!156 = !DILocation(line: 13, column: 8, scope: !77)
!157 = !DILocation(line: 15, column: 8, scope: !77)
!158 = !DILocation(line: 19, column: 8, scope: !77)
!159 = distinct !DISubprogram(name: "main_graph$async_dispatch_1_conv_32x112x112x3x3x3_f32", linkageName: "main_graph$async_dispatch_1_conv_32x112x112x3x3x3_f32", scope: !3, file: !3, line: 1, type: !78, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2)
!160 = !DILocation(line: 20, column: 8, scope: !159)
!161 = !DILocation(line: 14, column: 8, scope: !159)
!162 = !DILocation(line: 15, column: 8, scope: !159)
!163 = !DILocation(line: 16, column: 8, scope: !159)
!164 = !DILocation(line: 21, column: 8, scope: !159)
!165 = !DILocation(line: 9, column: 8, scope: !159)
!166 = !DILocation(line: 23, column: 10, scope: !159)
!167 = !DILocation(line: 24, column: 10, scope: !159)
!168 = !DILocation(line: 27, column: 8, scope: !159)
!169 = !DILocation(line: 29, column: 10, scope: !159)
!170 = !DILocation(line: 30, column: 10, scope: !159)
!171 = !DILocation(line: 31, column: 10, scope: !159)
!172 = !DILocation(line: 32, column: 10, scope: !159)
!173 = !DILocation(line: 33, column: 10, scope: !159)
!174 = !DILocation(line: 37, column: 8, scope: !159)
!175 = distinct !DISubprogram(name: "main_graph$async_dispatch_2_conv_112x112x32x3x3_f32", linkageName: "main_graph$async_dispatch_2_conv_112x112x32x3x3_f32", scope: !5, file: !5, line: 1, type: !78, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !4)
!176 = !DILocation(line: 21, column: 8, scope: !175)
!177 = !DILocation(line: 20, column: 8, scope: !175)
!178 = !DILocation(line: 14, column: 8, scope: !175)
!179 = !DILocation(line: 15, column: 8, scope: !175)
!180 = !DILocation(line: 16, column: 8, scope: !175)
!181 = !DILocation(line: 9, column: 8, scope: !175)
!182 = !DILocation(line: 23, column: 10, scope: !175)
!183 = !DILocation(line: 24, column: 10, scope: !175)
!184 = !DILocation(line: 27, column: 8, scope: !175)
!185 = !DILocation(line: 29, column: 10, scope: !175)
!186 = !DILocation(line: 30, column: 10, scope: !175)
!187 = !DILocation(line: 31, column: 10, scope: !175)
!188 = !DILocation(line: 32, column: 10, scope: !175)
!189 = !DILocation(line: 33, column: 10, scope: !175)
!190 = !DILocation(line: 37, column: 8, scope: !175)
!191 = distinct !DISubprogram(name: "main_graph$async_dispatch_3_matmul_like_64x12544x32_f32", linkageName: "main_graph$async_dispatch_3_matmul_like_64x12544x32_f32", scope: !7, file: !7, line: 1, type: !78, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6)
!192 = !DILocation(line: 14, column: 8, scope: !191)
!193 = !DILocation(line: 15, column: 8, scope: !191)
!194 = !DILocation(line: 16, column: 8, scope: !191)
!195 = !DILocation(line: 21, column: 8, scope: !191)
!196 = !DILocation(line: 24, column: 10, scope: !191)
!197 = !DILocation(line: 29, column: 10, scope: !191)
!198 = !DILocation(line: 30, column: 10, scope: !191)
!199 = !DILocation(line: 31, column: 10, scope: !191)
!200 = !DILocation(line: 32, column: 10, scope: !191)
!201 = !DILocation(line: 33, column: 10, scope: !191)
!202 = !DILocation(line: 37, column: 8, scope: !191)
!203 = distinct !DISubprogram(name: "main_graph$async_dispatch_4_slow_memcpy", linkageName: "main_graph$async_dispatch_4_slow_memcpy", scope: !9, file: !9, line: 1, type: !78, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8)
!204 = !DILocation(line: 11, column: 8, scope: !203)
!205 = !DILocation(line: 12, column: 8, scope: !203)
!206 = !DILocation(line: 13, column: 8, scope: !203)
!207 = !DILocation(line: 14, column: 8, scope: !203)
!208 = !DILocation(line: 16, column: 8, scope: !203)
!209 = !DILocation(line: 20, column: 8, scope: !203)
