; ModuleID = 'fastdepth_linked'
source_filename = "fastdepth_linked"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%iree_hal_executable_library_header_t = type { i32, ptr, i32, i32 }
%iree_hal_executable_dispatch_attrs_v0_t = type { i64, i16, i8, i8, i32, i32, i16, i16, i64, i64, i64, i64, i64 }
%iree_hal_executable_source_location_v0_t = type { i32, i32, ptr }
%iree_hal_executable_stage_location_table_v0_t = type { i32, ptr, ptr }
%iree_hal_executable_library_v0_t = type { ptr, %iree_hal_executable_import_table_v0_t, %iree_hal_executable_export_table_v0_t, %iree_hal_executable_constant_table_v0_t, %iree_hal_executable_source_file_table_v0_t }
%iree_hal_executable_import_table_v0_t = type { i32, ptr }
%iree_hal_executable_export_table_v0_t = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%iree_hal_executable_constant_table_v0_t = type { i32 }
%iree_hal_executable_source_file_table_v0_t = type { i32, ptr }
%iree_hal_executable_dispatch_state_v0_t = type { i32, i32, i16, i16, i32, i32, i16, i8, i8, ptr, ptr, ptr }
%iree_hal_executable_workgroup_state_v0_t = type { i32, i32, i16, i16, i32, ptr, i32 }


!49 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_32.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!50 = distinct !DICompileUnit(language: DW_LANG_C17, file: !51, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!51 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_33.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!52 = distinct !DICompileUnit(language: DW_LANG_C17, file: !53, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!53 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_34.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!54 = distinct !DICompileUnit(language: DW_LANG_C17, file: !55, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!55 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_35.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!56 = distinct !DICompileUnit(language: DW_LANG_C17, file: !57, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!57 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_36.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!58 = distinct !DICompileUnit(language: DW_LANG_C17, file: !59, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!59 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_37.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!60 = distinct !DICompileUnit(language: DW_LANG_C17, file: !61, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!61 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_38.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!62 = distinct !DICompileUnit(language: DW_LANG_C17, file: !63, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!63 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_39.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!64 = distinct !DICompileUnit(language: DW_LANG_C17, file: !65, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!65 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_40.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!66 = distinct !DICompileUnit(language: DW_LANG_C17, file: !67, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!67 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_41.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!68 = distinct !DICompileUnit(language: DW_LANG_C17, file: !69, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!69 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_42.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!70 = distinct !DICompileUnit(language: DW_LANG_C17, file: !71, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!71 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_43.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!72 = distinct !DICompileUnit(language: DW_LANG_C17, file: !73, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!73 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_44.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!74 = distinct !DICompileUnit(language: DW_LANG_C17, file: !75, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!75 = !DIFile(filename: "configured_fastdepth_main_graph$async_dispatch_45.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!76 = !{i32 2, !"Debug Info Version", i32 3}
!77 = !{i32 1, !"wchar_size", i32 4}
!78 = !{i32 7, !"frame-pointer", i32 2}
!79 = distinct !DISubprogram(name: "main_graph$async_dispatch_0_slow_memcpy", linkageName: "main_graph$async_dispatch_0_slow_memcpy", scope: !1, file: !1, line: 1, type: !80, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0)
!80 = !DISubroutineType(cc: DW_CC_normal, types: !81)
!81 = !{!82, !83, !114, !143}
!82 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "iree_hal_executable_environment_v0_t", baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_executable_environment_v0_t", scope: !87, file: !87, line: 246, size: 768, elements: !88)
!87 = !DIFile(filename: "runtime/src/iree/hal/local/executable_library.h", directory: ".")
!88 = !{!89, !97, !100, !103, !105}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "constants", baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!92 = !DICompositeType(tag: DW_TAG_array_type, scope: !87, file: !87, line: 227, baseType: !93, size: 2048, elements: !95)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", baseType: !94)
!94 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!95 = !{!96}
!96 = !DISubrange(count: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "import_thunk", baseType: !98, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIBasicType(name: "void", encoding: DW_ATE_address)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "import_funcs", baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "import_contexts", baseType: !104, size: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "processor", baseType: !106, offset: 256)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_processor_v0_t", scope: !87, file: !87, line: 227, size: 512, elements: !107)
!107 = !{!108}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "data", baseType: !109)
!109 = !DICompositeType(tag: DW_TAG_array_type, scope: !87, file: !87, line: 227, baseType: !110, size: 512, elements: !112)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", baseType: !111)
!111 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!112 = !{!113}
!113 = !DISubrange(count: 8)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "iree_hal_executable_dispatch_state_v0_t", baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_executable_dispatch_state_v0_t", scope: !87, file: !87, line: 275, size: 384, elements: !118)
!118 = !{!119, !120, !121, !124, !125, !126, !127, !128, !131, !132, !133, !138}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_size_x", baseType: !93, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_size_y", baseType: !93, size: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_size_z", baseType: !122, size: 16, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", baseType: !123)
!123 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "constant_count", baseType: !122, size: 16, offset: 80)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_count_x", baseType: !93, size: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_count_y", baseType: !93, size: 32, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_count_z", baseType: !122, size: 16, offset: 160)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "max_concurrency", baseType: !129, size: 8, offset: 176)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", baseType: !130)
!130 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "binding_count", baseType: !129, size: 8, offset: 184)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "constants", baseType: !90, size: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "binding_ptrs", baseType: !134, size: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = !DICompositeType(tag: DW_TAG_array_type, scope: !87, file: !87, line: 227, baseType: !137, size: 4096, elements: !95)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "binding_lengths", baseType: !139, size: 64, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DICompositeType(tag: DW_TAG_array_type, scope: !87, file: !87, line: 227, baseType: !142, size: 4096, elements: !95)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", baseType: !110)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "iree_hal_executable_workgroup_state_v0_t", baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_executable_workgroup_state_v0_t", scope: !87, file: !87, line: 321, size: 256, elements: !147)
!147 = !{!148, !149, !150, !151, !152, !153, !154}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_id_x", baseType: !93, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_id_y", baseType: !93, size: 32, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_id_z", baseType: !122, size: 16, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", baseType: !122, size: 16, offset: 80)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "processor_id", baseType: !93, size: 32, offset: 96)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "local_memory", baseType: !98, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "local_memory_size", baseType: !93, size: 32, offset: 192)
!155 = !DILocation(line: 10, column: 8, scope: !79)
!156 = !DILocation(line: 11, column: 8, scope: !79)
!157 = !DILocation(line: 12, column: 8, scope: !79)
!158 = !DILocation(line: 13, column: 8, scope: !79)
!159 = !DILocation(line: 15, column: 8, scope: !79)
!160 = !DILocation(line: 19, column: 8, scope: !79)
!161 = distinct !DISubprogram(name: "main_graph$async_dispatch_1_conv_32x112x112x3x3x3_f32", linkageName: "main_graph$async_dispatch_1_conv_32x112x112x3x3x3_f32", scope: !3, file: !3, line: 1, type: !80, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2)
!162 = !DILocation(line: 20, column: 8, scope: !161)
!163 = !DILocation(line: 14, column: 8, scope: !161)
!164 = !DILocation(line: 15, column: 8, scope: !161)
!165 = !DILocation(line: 16, column: 8, scope: !161)
!166 = !DILocation(line: 21, column: 8, scope: !161)
!167 = !DILocation(line: 9, column: 8, scope: !161)
!168 = !DILocation(line: 23, column: 10, scope: !161)
!169 = !DILocation(line: 24, column: 10, scope: !161)
!170 = !DILocation(line: 27, column: 8, scope: !161)
!171 = !DILocation(line: 29, column: 10, scope: !161)
!172 = !DILocation(line: 30, column: 10, scope: !161)
!173 = !DILocation(line: 31, column: 10, scope: !161)
!174 = !DILocation(line: 32, column: 10, scope: !161)
!175 = !DILocation(line: 33, column: 10, scope: !161)
!176 = !DILocation(line: 37, column: 8, scope: !161)
!177 = distinct !DISubprogram(name: "main_graph$async_dispatch_2_conv_112x112x32x3x3_f32", linkageName: "main_graph$async_dispatch_2_conv_112x112x32x3x3_f32", scope: !5, file: !5, line: 1, type: !80, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !4)
!178 = !DILocation(line: 21, column: 8, scope: !177)
!179 = !DILocation(line: 20, column: 8, scope: !177)
!180 = !DILocation(line: 14, column: 8, scope: !177)
!181 = !DILocation(line: 15, column: 8, scope: !177)
!182 = !DILocation(line: 16, column: 8, scope: !177)
!183 = !DILocation(line: 9, column: 8, scope: !177)
!184 = !DILocation(line: 23, column: 10, scope: !177)
!185 = !DILocation(line: 24, column: 10, scope: !177)
!186 = !DILocation(line: 27, column: 8, scope: !177)
!187 = !DILocation(line: 29, column: 10, scope: !177)
!188 = !DILocation(line: 30, column: 10, scope: !177)
!189 = !DILocation(line: 31, column: 10, scope: !177)
!190 = !DILocation(line: 32, column: 10, scope: !177)
!191 = !DILocation(line: 33, column: 10, scope: !177)
!192 = !DILocation(line: 37, column: 8, scope: !177)
!193 = distinct !DISubprogram(name: "main_graph$async_dispatch_3_matmul_like_64x12544x32_f32", linkageName: "main_graph$async_dispatch_3_matmul_like_64x12544x32_f32", scope: !7, file: !7, line: 1, type: !80, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6)
!194 = !DILocation(line: 14, column: 8, scope: !193)
!195 = !DILocation(line: 15, column: 8, scope: !193)
!196 = !DILocation(line: 16, column: 8, scope: !193)
!197 = !DILocation(line: 21, column: 8, scope: !193)
!198 = !DILocation(line: 24, column: 10, scope: !193)
!199 = !DILocation(line: 29, column: 10, scope: !193)
!200 = !DILocation(line: 30, column: 10, scope: !193)
!201 = !DILocation(line: 31, column: 10, scope: !193)
!202 = !DILocation(line: 32, column: 10, scope: !193)
!203 = !DILocation(line: 33, column: 10, scope: !193)
!204 = !DILocation(line: 37, column: 8, scope: !193)
!205 = distinct !DISubprogram(name: "main_graph$async_dispatch_4_slow_memcpy", linkageName: "main_graph$async_dispatch_4_slow_memcpy", scope: !9, file: !9, line: 1, type: !80, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8)
!206 = !DILocation(line: 11, column: 8, scope: !205)
!207 = !DILocation(line: 12, column: 8, scope: !205)
!208 = !DILocation(line: 13, column: 8, scope: !205)
!209 = !DILocation(line: 14, column: 8, scope: !205)
!210 = !DILocation(line: 16, column: 8, scope: !205)
!211 = !DILocation(line: 20, column: 8, scope: !205)
