; ModuleID = 'dronet_linked'
source_filename = "dronet_linked"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%iree_hal_executable_library_header_t = type { i32, ptr, i32, i32 }
%iree_hal_executable_dispatch_attrs_v0_t = type { i64, i16, i8, i8, i32, i32, i16, i16, i64, i64, i64, i64, i64 }
%iree_hal_executable_source_location_v0_t = type { i32, i32, ptr }
%iree_hal_executable_stage_location_table_v0_t = type { i32, ptr, ptr }
%iree_hal_executable_library_v0_t = type { ptr, %iree_hal_executable_import_table_v0_t, %iree_hal_executable_export_table_v0_t, %iree_hal_executable_constant_table_v0_t, %iree_hal_executable_source_file_table_v0_t }
%iree_hal_executable_import_table_v0_t = type { i32, ptr }
%iree_hal_executable_export_table_v0_t = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%iree_hal_executable_constant_table_v0_t = type { i32 }
%iree_hal_executable_source_file_table_v0_t = type { i32, ptr }
%iree_hal_executable_dispatch_state_v0_t = type { i32, i32, i16, i16, i32, i32, i16, i8, i8, ptr, ptr, ptr }
%iree_hal_executable_workgroup_state_v0_t = type { i32, i32, i16, i16, i32, ptr, i32 }


!2 = distinct !DICompileUnit(language: DW_LANG_C17, file: !3, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!3 = !DIFile(filename: "configured_module_main_graph$async_dispatch_1.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!4 = distinct !DICompileUnit(language: DW_LANG_C17, file: !5, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!5 = !DIFile(filename: "configured_module_main_graph$async_dispatch_2.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!6 = distinct !DICompileUnit(language: DW_LANG_C17, file: !7, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!7 = !DIFile(filename: "configured_module_main_graph$async_dispatch_3.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!8 = distinct !DICompileUnit(language: DW_LANG_C17, file: !9, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!9 = !DIFile(filename: "configured_module_main_graph$async_dispatch_4.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!10 = distinct !DICompileUnit(language: DW_LANG_C17, file: !11, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!11 = !DIFile(filename: "configured_module_main_graph$async_dispatch_5.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!12 = distinct !DICompileUnit(language: DW_LANG_C17, file: !13, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!13 = !DIFile(filename: "configured_module_main_graph$async_dispatch_6.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!14 = distinct !DICompileUnit(language: DW_LANG_C17, file: !15, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!15 = !DIFile(filename: "configured_module_main_graph$async_dispatch_7.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!16 = distinct !DICompileUnit(language: DW_LANG_C17, file: !17, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!17 = !DIFile(filename: "configured_module_main_graph$async_dispatch_8.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!18 = distinct !DICompileUnit(language: DW_LANG_C17, file: !19, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!19 = !DIFile(filename: "configured_module_main_graph$async_dispatch_9.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!20 = distinct !DICompileUnit(language: DW_LANG_C17, file: !21, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!21 = !DIFile(filename: "configured_module_main_graph$async_dispatch_10.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!22 = distinct !DICompileUnit(language: DW_LANG_C17, file: !23, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!23 = !DIFile(filename: "configured_module_main_graph$async_dispatch_11.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!24 = distinct !DICompileUnit(language: DW_LANG_C17, file: !25, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!25 = !DIFile(filename: "configured_module_main_graph$async_dispatch_12.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!26 = distinct !DICompileUnit(language: DW_LANG_C17, file: !27, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!27 = !DIFile(filename: "configured_module_main_graph$async_dispatch_13.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!28 = distinct !DICompileUnit(language: DW_LANG_C17, file: !29, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!29 = !DIFile(filename: "configured_module_main_graph$async_dispatch_14.mlir", directory: "/scratch2/merlin/samples/robotic-NN/example_workload_mlir/workload_mlir/models/configs")
!30 = !{i32 2, !"Debug Info Version", i32 3}
!31 = !{i32 1, !"wchar_size", i32 4}
!32 = !{i32 7, !"frame-pointer", i32 2}
!33 = distinct !DISubprogram(name: "main_graph$async_dispatch_0_slow_memcpy", linkageName: "main_graph$async_dispatch_0_slow_memcpy", scope: !1, file: !1, line: 1, type: !34, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0)
!34 = !DISubroutineType(cc: DW_CC_normal, types: !35)
!35 = !{!36, !37, !68, !97}
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "iree_hal_executable_environment_v0_t", baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_executable_environment_v0_t", scope: !41, file: !41, line: 246, size: 768, elements: !42)
!41 = !DIFile(filename: "runtime/src/iree/hal/local/executable_library.h", directory: ".")
!42 = !{!43, !51, !54, !57, !59}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "constants", baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_array_type, scope: !41, file: !41, line: 227, baseType: !47, size: 2048, elements: !49)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", baseType: !48)
!48 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!49 = !{!50}
!50 = !DISubrange(count: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "import_thunk", baseType: !52, size: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIBasicType(name: "void", encoding: DW_ATE_address)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "import_funcs", baseType: !55, size: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "import_contexts", baseType: !58, size: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "processor", baseType: !60, offset: 256)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_processor_v0_t", scope: !41, file: !41, line: 227, size: 512, elements: !61)
!61 = !{!62}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "data", baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_array_type, scope: !41, file: !41, line: 227, baseType: !64, size: 512, elements: !66)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", baseType: !65)
!65 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!66 = !{!67}
!67 = !DISubrange(count: 8)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "iree_hal_executable_dispatch_state_v0_t", baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_executable_dispatch_state_v0_t", scope: !41, file: !41, line: 275, size: 384, elements: !72)
!72 = !{!73, !74, !75, !78, !79, !80, !81, !82, !85, !86, !87, !92}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_size_x", baseType: !47, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_size_y", baseType: !47, size: 32, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_size_z", baseType: !76, size: 16, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", baseType: !77)
!77 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "constant_count", baseType: !76, size: 16, offset: 80)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_count_x", baseType: !47, size: 32, offset: 96)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_count_y", baseType: !47, size: 32, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_count_z", baseType: !76, size: 16, offset: 160)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "max_concurrency", baseType: !83, size: 8, offset: 176)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", baseType: !84)
!84 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "binding_count", baseType: !83, size: 8, offset: 184)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "constants", baseType: !44, size: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "binding_ptrs", baseType: !88, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!90 = !DICompositeType(tag: DW_TAG_array_type, scope: !41, file: !41, line: 227, baseType: !91, size: 4096, elements: !49)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "binding_lengths", baseType: !93, size: 64, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!95 = !DICompositeType(tag: DW_TAG_array_type, scope: !41, file: !41, line: 227, baseType: !96, size: 4096, elements: !49)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", baseType: !64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "iree_hal_executable_workgroup_state_v0_t", baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_executable_workgroup_state_v0_t", scope: !41, file: !41, line: 321, size: 256, elements: !101)
!101 = !{!102, !103, !104, !105, !106, !107, !108}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_id_x", baseType: !47, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_id_y", baseType: !47, size: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_id_z", baseType: !76, size: 16, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", baseType: !76, size: 16, offset: 80)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "processor_id", baseType: !47, size: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "local_memory", baseType: !52, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "local_memory_size", baseType: !47, size: 32, offset: 192)
!109 = !DILocation(line: 10, column: 8, scope: !33)
!110 = !DILocation(line: 11, column: 8, scope: !33)
!111 = !DILocation(line: 12, column: 8, scope: !33)
!112 = !DILocation(line: 13, column: 8, scope: !33)
!113 = !DILocation(line: 15, column: 8, scope: !33)
!114 = !DILocation(line: 19, column: 8, scope: !33)
!115 = distinct !DISubprogram(name: "main_graph$async_dispatch_1_conv_32x112x112x5x5_f32", linkageName: "main_graph$async_dispatch_1_conv_32x112x112x5x5_f32", scope: !3, file: !3, line: 1, type: !34, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2)
!116 = !DILocation(line: 20, column: 8, scope: !115)
!117 = !DILocation(line: 14, column: 8, scope: !115)
!118 = !DILocation(line: 15, column: 8, scope: !115)
!119 = !DILocation(line: 16, column: 8, scope: !115)
!120 = !DILocation(line: 21, column: 8, scope: !115)
!121 = !DILocation(line: 27, column: 8, scope: !115)
!122 = !DILocation(line: 9, column: 8, scope: !115)
!123 = !DILocation(line: 23, column: 10, scope: !115)
!124 = !DILocation(line: 24, column: 10, scope: !115)
!125 = !DILocation(line: 29, column: 10, scope: !115)
!126 = !DILocation(line: 33, column: 8, scope: !115)
!127 = distinct !DISubprogram(name: "main_graph$async_dispatch_2_conv_32x55x55x3x3_f32", linkageName: "main_graph$async_dispatch_2_conv_32x55x55x3x3_f32", scope: !5, file: !5, line: 1, type: !34, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !4)
!128 = !DILocation(line: 16, column: 8, scope: !127)
!129 = !DILocation(line: 17, column: 8, scope: !127)
!130 = !DILocation(line: 18, column: 8, scope: !127)
!131 = !DILocation(line: 23, column: 8, scope: !127)
!132 = !DILocation(line: 30, column: 10, scope: !127)
!133 = !DILocation(line: 28, column: 8, scope: !127)
!134 = !DILocation(line: 9, column: 8, scope: !127)
!135 = !DILocation(line: 25, column: 10, scope: !127)
!136 = !DILocation(line: 31, column: 10, scope: !127)
!137 = !DILocation(line: 32, column: 10, scope: !127)
!138 = !DILocation(line: 33, column: 10, scope: !127)
!139 = !DILocation(line: 34, column: 10, scope: !127)
!140 = !DILocation(line: 35, column: 10, scope: !127)
!141 = !DILocation(line: 40, column: 8, scope: !127)
!142 = distinct !DISubprogram(name: "main_graph$async_dispatch_3_conv_32x28x28x32x3x3_f32", linkageName: "main_graph$async_dispatch_3_conv_32x28x28x32x3x3_f32", scope: !7, file: !7, line: 1, type: !34, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6)
!143 = !DILocation(line: 20, column: 8, scope: !142)
!144 = !DILocation(line: 14, column: 8, scope: !142)
!145 = !DILocation(line: 15, column: 8, scope: !142)
!146 = !DILocation(line: 16, column: 8, scope: !142)
!147 = !DILocation(line: 21, column: 8, scope: !142)
!148 = !DILocation(line: 27, column: 8, scope: !142)
!149 = !DILocation(line: 9, column: 8, scope: !142)
!150 = !DILocation(line: 23, column: 10, scope: !142)
!151 = !DILocation(line: 24, column: 10, scope: !142)
!152 = !DILocation(line: 29, column: 10, scope: !142)
!153 = !DILocation(line: 30, column: 10, scope: !142)
!154 = !DILocation(line: 31, column: 10, scope: !142)
!155 = !DILocation(line: 35, column: 8, scope: !142)
!156 = distinct !DISubprogram(name: "main_graph$async_dispatch_4_matmul_like_32x28x28x32_f32", linkageName: "main_graph$async_dispatch_4_matmul_like_32x28x28x32_f32", scope: !9, file: !9, line: 1, type: !34, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !8)
!157 = !DILocation(line: 13, column: 8, scope: !156)
!158 = !DILocation(line: 14, column: 8, scope: !156)
!159 = !DILocation(line: 15, column: 8, scope: !156)
!160 = !DILocation(line: 20, column: 8, scope: !156)
!161 = !DILocation(line: 23, column: 10, scope: !156)
!162 = !DILocation(line: 27, column: 8, scope: !156)
